[
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1667440347i/63209939.jpg",
        "description": "The Raven Boys meets Ninth House in the most exciting debut of 2022 -- a dark, atmospheric fantasy about a Deaf college student with a peculiar connection to the afterlife.\n\nDelaney Meyers-Petrov is tired of being seen as fragile just because she's Deaf. So when she's accepted into a prestigious program at Godbole University that trains students to slip between parallel worlds, she's excited for the chance to prove herself. But her semester gets off to a rocky start as she faces professors who won't accommodate her disability, and a pretentious upperclassman fascinated by Delaney's unusual talents.\n\nColton Price died when he was nine years old. Quite impossibly, he woke several weeks later at the feet of a green-eyed little girl. Now, twelve years later, Delaney Meyers-Petrov has stumbled back into his orbit, but Colton's been ordered to keep far away from the new girl... and the voices she hears calling to her from the shadows.\n\nDelaney wants to keep her distance from Colton -- she seems to be the only person on campus who finds him more arrogant than charming -- yet after a Godbole student turns up dead, she and Colton are forced to form a tenuous alliance, plummeting down a rabbit-hole of deeply buried university secrets. But Delaney and Colton discover the cost of opening the doors between worlds when they find themselves up against something old and nameless, an enemy they need to destroy before it tears them -- and their forbidden partnership -- apart.",
        "pages": 400,
        "publisher": "Scholastic Press",
        "publishedDate": "October 18, 2022",
        "author": "Kelly Andrew",
        "title": "The Whispering Dark",
        "tags": [
            "Fantasy",
            "Young Adult",
            "Paranormal",
            "Romance",
            "Urban Fantasy",
            "Fiction",
            "Mystery",
            "Horror",
            "Young Adult Fantasy",
            "Disability"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1659411218i/58340706.jpg",
        "description": "Elspeth needs a monster. The monster might be her.\n\nElspeth Spindle needs more than luck to stay safe in the eerie, mist-locked kingdom of Blunder—she needs a monster. She calls him the Nightmare, an ancient, mercurial spirit trapped in her head. He protects her. He keeps her secrets.\n\nBut nothing comes for free, especially magic.\n\nWhen Elspeth meets a mysterious highwayman on the forest road, her life takes a drastic turn. Thrust into a world of shadow and deception, she joins a dangerous quest to cure Blunder from the dark magic infecting it. And the highwayman? He just so happens to be the King’s nephew, Captain of the most dangerous men in Blunder…and guilty of high treason.\n\nTogether they must gather twelve Providence Cards—the keys to the cure. But as the stakes heighten and their undeniable attraction intensifies, Elspeth is forced to face her darkest secret yet: the Nightmare is slowly taking over her mind. And she might not be able to stop him.",
        "pages": 432,
        "publisher": "Orbit",
        "publishedDate": "September 27, 2022",
        "author": "Rachel Gillig",
        "title": "One Dark Window",
        "tags": [
            "Fantasy",
            "Gothic",
            "Horror",
            "Young Adult",
            "Romance",
            "Fiction",
            "Adult",
            "Magic",
            "Young Adult Fantasy",
            "Fantasy Romance"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1633986670i/59227936.jpg",
        "description": "New York Times bestselling author Adalyn Grace brings to life a highly romantic, Gothic-infused world of wealth, desire, and betrayal.\n\nOrphaned as a baby, nineteen-year-old Signa has been raised by a string of guardians, each more interested in her wealth than her well-being—and each has met an untimely end. Her remaining relatives are the elusive Hawthornes, an eccentric family living at Thorn Grove, an estate both glittering and gloomy. Its patriarch mourns his late wife through wild parties, while his son grapples for control of the family’s waning reputation, and his daughter suffers from a mysterious illness. But when their mother’s restless spirit appears claiming she was poisoned, Signa realizes that the family she depends on could be in grave danger and enlists the help of a surly stable boy to hunt down the killer.\n \nHowever, Signa’s best chance of uncovering the murderer is an alliance with Death himself, a fascinating, dangerous shadow who has never been far from her side. Though he’s made her life a living hell, Death shows Signa that their growing connection may be more powerful—and more irresistible—than she ever dared imagine.",
        "pages": 416,
        "publisher": "Little, Brown Books for Young Readers",
        "publishedDate": "August 30, 2022",
        "author": "Adalyn Grace",
        "title": "Belladonna",
        "tags": [
            "Fantasy",
            "Young Adult",
            "Romance",
            "Mystery",
            "Paranormal",
            "Gothic",
            "Fiction",
            "Young Adult Fantasy",
            "Historical Fiction",
            "Thriller"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1645642179i/59808071.jpg",
        "description": "Not every love is meant to be.\n\nAfter Jacks, the Prince of Hearts, betrays her, Evangeline Fox swears she'll never trust him again. Now that she’s discovered her own magic, Evangeline believes she can use it to restore the chance at happily ever after that Jacks stole away.\n\nBut when a new terrifying curse is revealed, Evangeline finds herself entering into a tenuous partnership with the Prince of Hearts again. Only this time, the rules have changed. Jacks isn’t the only force Evangeline needs to be wary of. In fact, he might be the only one she can trust, despite her desire to despise him.\n\nInstead of a love spell wreaking havoc on Evangeline’s life, a murderous spell has been cast. To break it, Evangeline and Jacks will have to do battle with old friends, new foes, and a magic that plays with heads and hearts. Evangeline has always trusted her heart, but this time she’s not sure she can...",
        "pages": 403,
        "publisher": "Flatiron Books",
        "publishedDate": "September 13, 2022",
        "author": "Stephanie Garber",
        "title": "The Ballad of Never After",
        "tags": [
            "Fantasy",
            "Romance",
            "Young Adult",
            "Young Adult Fantasy",
            "Fiction",
            "Magic",
            "Fantasy Romance",
            "Audiobook",
            "Vampires",
            "High Fantasy"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1644386147i/58470171.jpg",
        "description": "Emilia is reeling from the shocking discovery that her twin sister, Vittoria, is alive. But before she faces the demons of her past, Emilia yearns to claim her king, the seductive Prince of Wrath, in the flesh. Emilia doesn’t simply desire his body, she wants his heart and soul—but that’s something the enigmatic demon can’t promise her.\n\nWhen a high-ranking member of House Greed is assassinated, Emilia and Wrath are drawn to the rival demon court. Damning evidence points to Vittoria as the murderer and she’s quickly declared an enemy of the Seven Circles. Despite her betrayal, Emilia will do anything to solve this new mystery and find out who her sister really is.\n\nTogether Emilia and Wrath play a sin-fueled game of deception as they work to stop the unrest that’s brewing between witches, demons, shape-shifters and the most treacherous foes of all: the Feared.\n\nEmilia was warned that when it came to the Wicked nothing was as it seemed. But, have the true villains been much closer all along? When the truth is finally revealed, it just might end up costing Emilia her heart.\n\nTwo curses.\nOne prophecy.\nA reckoning all have feared.\n\nAnd a love more powerful than fate. All hail the king and queen of Hell.\n\nFrom the #1 New York Times bestselling author of the Stalking the Jack the Ripper series comes the steamy conclusion to Kingdom of the Wicked trilogy.",
        "pages": 464,
        "publisher": "Little, Brown Books for Young Readers",
        "publishedDate": "September 27, 2022",
        "author": "Kerri Maniscalco",
        "title": "Kingdom of the Feared",
        "tags": [
            "Fantasy",
            "Romance",
            "Young Adult",
            "New Adult",
            "Witches",
            "Paranormal",
            "Fantasy Romance",
            "Fiction",
            "Magic",
            "Young Adult Fantasy"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1638258882i/58311939.jpg",
        "description": "Brie finds herself caught between two princes and two destinies while the future of the fae realm hangs in the balance.\n\nAfter Abriella's sister was sold to the fae, she thought life couldn't get any worse. But when she suddenly finds herself caught in a web of lies of her own making ­- loving two princes and trusting neither - things are not quite as clear as she once thought.\n\nAs civil war wages in the Court of Darkness, Brie finds herself unable to choose a side. How can she know where she stands when she doesn't even know herself anymore? In this darkly romantic thrill ride, the more Faerie is torn apart from the inside, the clearer it becomes that prophecies don't lie and Brie has a role to play in the fate of this magical realm - whether she likes it or not.",
        "pages": 496,
        "publisher": "Clarion Books",
        "publishedDate": "July 19, 2022",
        "author": "Lexi Ryan",
        "title": "These Twisted Bonds",
        "tags": [
            "Fantasy",
            "Romance",
            "Young Adult",
            "Fae",
            "Fantasy Romance",
            "Young Adult Fantasy",
            "Fiction",
            "Magic",
            "New Adult",
            "Audiobook"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1654577187i/59449896.jpg",
        "description": "From #1 New York Times bestselling author Jennifer L. Armentrout comes book two in her Flesh and Fire series…\n\nThe only one who can save Sera now is the one she spent her life planning to kill.\n\nThe truth about Sera’s plan is out, shattering the fragile trust forged between her and Nyktos. Surrounded by those distrustful of her, all Sera has is her duty. She will do anything to end Kolis, the false King of Gods, and his tyrannical rule of Iliseeum, thus stopping the threat he poses to the mortal realm.\n\nNyktos has a plan, though, and as they work together, the last thing they need is the undeniable, scorching passion that continues to ignite between them. Sera cannot afford to fall for the tortured Primal, not when a life no longer bound to a destiny she never wanted is more attainable than ever. But memories of their shared pleasure and unrivaled desire are a siren’s call impossible to resist.\n\nAnd as Sera begins to realize that she wants to be more than a Consort in name only, the danger surrounding them intensifies. The attacks on the Shadowlands are increasing, and when Kolis summons them to Court, a whole new risk becomes apparent. The Primal power of Life is growing inside her, pushing her closer to the end of her Culling. And without Nyktos’s love—an emotion he’s incapable of feeling—she won’t survive her Ascension. That is if she even makes it to her Ascension and Kolis doesn’t get to her first. Because time is running out. For both her and the realms.",
        "pages": 650,
        "publisher": "Blue Box Press",
        "publishedDate": "November 15, 2022",
        "author": "Jennifer L. Armentrout",
        "title": "A Light in the Flame",
        "tags": [
            "Fantasy",
            "Romance",
            "Fantasy Romance",
            "Adult",
            "New Adult",
            "Paranormal",
            "Fiction",
            "High Fantasy",
            "Audiobook",
            "Vampires"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1665666495i/62982768.jpg",
        "description": "Plucked out of the Collector’s Pens, auctioned off to a vampire contingent, and sent across the ocean to the Alpha Territories was not exactly how I planned to spend my week.\n\nActually, scratch that. I had planned the first bit. But I was supposed to be sold to the werewolves so I could save my friend from a fate worse than death. Instead, the bloodsuckers have me and so far? It's not going great. I've been shoved into a corset and made to look like an extra on the cast of Bridgerton, all to take part in the Harvest Games—think The Bachelor set in the 1800s, but the men are all vampires, and then add a decidedly terrifying Squid Games element to the mix.\n\nNo problem.\n\nMy goal—besides keeping the number of holes in my body to the current norm—is more than surviving. It is escaping the inescapable, finding my way to the werewolf territory, and getting Jordan back.\n\nCue the political strife.\n\nArmed with nothing more than a super sharp hairpin, my questionable charm, and an irrational amount of optimism plans to get both me and my bestie out alive are in full swing.\n\nUntil the General of the Vampire Army and his molten eyes light me on fire and leave me wondering if escape is what I want after all.\n\nMaybe one extra set of holes wouldn’t be the worst thing ever...",
        "pages": 347,
        "publisher": "Hijinks Ink Publishing",
        "publishedDate": "October 31, 2022",
        "author": "Shannon Mayer",
        "title": "Taken by Fate",
        "tags": [
            "Fantasy",
            "Vampires",
            "Paranormal",
            "Romance",
            "Paranormal Romance",
            "Urban Fantasy",
            "Magic",
            "Dark",
            "Shapeshifters",
            "Fiction"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1666764547i/63060755.jpg",
        "description": "Welcome to the City of Secrets & Sin\n\nWhen I inherit a haunted bookstore in New Orleans, I go from demon hunter to my dream job. Unfortunately, there’s a dark side to my beautiful new life—the gorgeous demon who seems to think he owns the place.\n\nThe attraction between us is insane, and we can’t keep our eyes off each other. But I don’t trust him one bit—especially not the way he uses his seductive charms to try to compel me to work for him.\n\nWhen a young girl is kidnapped from right outside my house, he’s the first person on my mind. I just can’t figure out if he’s the culprit or my fiercest protector. But I do know he has answers. And I have to resist his dangerous allure, because to give in is to risk losing everything—including my life.\n\nCity of Night is the first in the Secrets & Sin trilogy. It's got enemies to lovers, fated mates, and a tortured hero who is absolutely obsessed with the heroine (but doesn't want to be).",
        "pages": 338,
        "publisher": "Bonnie Doon Press",
        "publishedDate": "October 28, 2022",
        "author": "Linsey Hall",
        "title": "City of Night",
        "tags": [
            "Urban Fantasy",
            "Fantasy",
            "Demons",
            "Romance",
            "Paranormal Romance",
            "Paranormal",
            "Mystery",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1662055400i/61272184.jpg",
        "description": "In this sequel novella to Sorcery of Thorns, Elisabeth, Nathaniel, and Silas must unravel the magical trap keeping them inside Thorn Manor in time for their Midwinter Ball!\n\nElisabeth Scrivener is finally settling into her new life with sorcerer Nathaniel Thorn. Now that their demon companion Silas has returned, so has scrutiny from nosy reporters hungry for gossip about the city's most powerful sorcerer and the librarian who stole his heart. But something strange is afoot at Thorn Manor: the estate's wards, which are meant to keep their home safe, are acting up and forcibly trapping the Manor's occupants inside. Surely it must be a coincidence that this happened just as Nathaniel and Elisabeth started getting closer to one another...\n\nWith no access to the outside world, Elisabeth, Nathaniel, and Silas - along with their new maid Mercy - will have to work together to discover the source of the magic behind the malfunctioning wards before they're due to host the city's Midwinter Ball. Not an easy task when the house is filled with unexpected secrets, and all Elisabeth can think about is kissing Nathaniel in peace. But when it becomes clear that the house, influenced by the magic of Nathaniel's ancestors, requires a price for its obedience, Elisabeth and Nathaniel will have to lean on their connection like never before to set things right.",
        "pages": 192,
        "publisher": "Margaret K. McElderry Books",
        "publishedDate": "January 17, 2023",
        "author": "Margaret Rogerson",
        "title": "Mysteries of Thorn Manor",
        "tags": [
            "Fantasy",
            "Young Adult",
            "Romance",
            "Novella",
            "Young Adult Fantasy",
            "Magic",
            "Fiction",
            "High Fantasy",
            "Mystery",
            "Paranormal"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1661410548i/58303740.jpg",
        "description": "In a fallen kingdom, one girl carries the key to discovering the secrets of her nation’s past—and unleashing the demons that sleep at its heart. An epic fantasy series inspired by the mythology and folklore of ancient China.\n\nOnce, Lan had a different name. Now she goes by the one the Elantian colonizers gave her when they invaded her kingdom, killed her mother, and outlawed her people’s magic. She spends her nights as a songgirl in Haak’gong, a city transformed by the conquerors, and her days scavenging for what she can find of the past. Anything to understand the strange mark burned into her arm by her mother in her last act before she died.\n\nThe mark is mysterious—an untranslatable Hin character—and no one but Lan can see it. Until the night a boy appears at her teahouse and saves her life.\n\nZen is a practitioner—one of the fabled magicians of the Last Kingdom. Their magic was rumored to have been drawn from the demons they communed with. Magic believed to be long lost. Now it must be hidden from the Elantians at all costs.\n\nWhen Zen comes across Lan, he recognizes what she is: a practitioner with a powerful ability hidden in the mark on her arm. He’s never seen anything like it—but he knows that if there are answers, they lie deep in the pine forests and misty mountains of the Last Kingdom, with an order of practitioning masters planning to overthrow the Elantian regime.\n\nBoth Lan and Zen have secrets buried deep within—secrets they must hide from others, and secrets that they themselves have yet to discover. Fate has connected them, but their destiny remains unwritten. Both hold the power to liberate their land. And both hold the power to destroy the world.\n\nNow the battle for the Last Kingdom begins.",
        "pages": 512,
        "publisher": "Delacorte Press",
        "publishedDate": "January 3, 2023",
        "author": "Amélie Wen Zhao",
        "title": "Song of Silver, Flame Like Night",
        "tags": [
            "Fantasy",
            "Young Adult",
            "Mythology",
            "Young Adult Fantasy",
            "Fiction",
            "Dragons",
            "Magic",
            "Asian Literature",
            "High Fantasy",
            "Science Fiction Fantasy"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1654300847i/59397314.jpg",
        "description": "In this lush, romantic new epic fantasy series from New York Times bestselling author Hannah Whitten, a young woman's secret power to raise the dead plunges her into the dangerous and glamorous world of the Sainted King's royal court.\n\nWhen Lore was thirteen, she escaped a cult in the catacombs beneath the city of Dellaire. And in the ten years since, she’s lived by one rule: don’t let them find you. Easier said than done, when her death magic ties her to the city.\n\nMortem, the magic born from death, is a high-priced and illicit commodity in Dellaire, and Lore’s job running poisons keeps her in food, shelter, and relative security. But when a run goes wrong and Lore’s power is revealed, she’s taken by the Presque Mort, a group of warrior-monks sanctioned to use Mortem working for the Sainted King. Lore fully expects a pyre, but King August has a different plan. Entire villages on the outskirts of the country have been dying overnight, seemingly at random. Lore can either use her magic to find out what’s happening and who in the King’s court is responsible, or die.\n\nLore is thrust into the Sainted King’s glittering court, where no one can be believed and even fewer can be trusted. Guarded by Gabriel, a duke-turned-monk, and continually running up against Bastian, August’s ne’er-do-well heir, Lore tangles in politics, religion, and forbidden romance as she attempts to navigate a debauched and opulent society.\n\nBut the life she left behind in the catacombs is catching up with her. And even as Lore makes her way through the Sainted court above, they might be drawing closer than she thinks.",
        "pages": 400,
        "publisher": "Orbit Books",
        "publishedDate": "March 7, 2023",
        "author": "Hannah F. Whitten",
        "title": "The Foxglove King",
        "tags": [
            "Fantasy",
            "Romance",
            "Adult",
            "Fantasy Romance",
            "LGBT",
            "Fiction",
            "Young Adult Fantasy",
            "Young Adult",
            "High Fantasy",
            "Adult Fiction"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1655928079i/60784546.jpg",
        "description": "After centuries of sleep, the gods are warring again. But eighteen-year-old Iris Winnow just wants to hold her family together. Her mother is suffering from addiction and her brother is missing from the front lines. Her best bet is to win the columnist promotion at the Oath Gazette.\n\nTo combat her worries, Iris writes letters to her brother and slips them beneath her wardrobe door, where they vanish―into the hands of Roman Kitt, her cold and handsome rival at the paper. When he anonymously writes Iris back, the two of them forge a connection that will follow Iris all the way to the front lines of battle: for her brother, the fate of mankind, and love.\n\nWhen two young rival journalists find love through a magical connection, they must face the depths of hell, in a war among gods, to seal their fate forever. Shadow and Bone meets Lore in this epic enemies-to-lovers fantasy novel filled with hope and heartbreak, and the unparalleled power of love.",
        "pages": 368,
        "publisher": "Wednesday Books",
        "publishedDate": "April 4, 2023",
        "author": "Rebecca Ross",
        "title": "Divine Rivals",
        "tags": [
            "Fantasy",
            "Young Adult",
            "Romance",
            "Historical Fiction",
            "Young Adult Fantasy",
            "Historical Fantasy",
            "Historical",
            "Fiction",
            "Young Adult Romance",
            "Young Adult Historical Fiction"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1651622856i/60657589.jpg",
        "description": "A curmudgeonly professor journeys to a small town in the far north to study faerie folklore and discovers dark fae magic, friendship, and love, in this heartwarming and enchanting fantasy.\n\nCambridge professor Emily Wilde is good at many things: She is the foremost expert on the study of faeries. She is a genius scholar and a meticulous researcher who is writing the world's first encyclopaedia of faerie lore. But Emily Wilde is not good at people. She could never make small talk at a party--or even get invited to one. And she prefers the company of her books, her dog, Shadow, and the Fair Folk to other people.\n\nSo when she arrives in the hardscrabble village of Hrafnsvik, Emily has no intention of befriending the gruff townsfolk. Nor does she care to spend time with another new arrival: her dashing and insufferably handsome academic rival Wendell Bambleby, who manages to charm the townsfolk, get in the middle of Emily's research, and utterly confound and frustrate her.\n\nBut as Emily gets closer and closer to uncovering the secrets of the Hidden Ones--the most elusive of all faeries--lurking in the shadowy forest outside the town, she also finds herself on the trail of another mystery: Who is Wendell Bambleby, and what does he really want? To find the answer, she'll have to unlock the greatest mystery of all--her own heart.",
        "pages": 336,
        "publisher": "Del Rey Books",
        "publishedDate": "January 10, 2023",
        "author": "Heather Fawcett",
        "title": "Emily Wilde's Encyclopaedia of Faeries",
        "tags": [
            "Fantasy",
            "Romance",
            "Adult",
            "Historical Fiction",
            "Fiction",
            "Fae",
            "Historical",
            "Fairies",
            "Magical Realism",
            "Magic"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1669081314i/61150759.jpg",
        "description": "A sumptuous, gothic-infused story about a marriage that is unraveled by dark secrets, a friendship cursed to end in tragedy, and the danger of believing in fairy tales--the breathtaking adult debut from New York Times bestselling author Roshani Chokshi.\n\nOnce upon a time, a man who believed in fairy tales married a beautiful, mysterious woman named Indigo Maxwell-Casteñada. He was a scholar of myths. She was heiress to a fortune. They exchanged gifts and stories and believed they would live happily ever after--and in exchange for her love, Indigo extracted a promise: that her bridegroom would never pry into her past.\n\nBut when Indigo learns that her estranged aunt is dying and the couple is forced to return to her childhood home, the House of Dreams, the bridegroom will soon find himself unable to resist. For within the crumbling manor's extravagant rooms and musty halls, there lurks the shadow of another girl: Azure, Indigo's dearest childhood friend who suddenly disappeared. As the house slowly reveals his wife's secrets, the bridegroom will be forced to choose between reality and fantasy, even if doing so threatens to destroy their marriage . . . or their lives.\n\nCombining the lush, haunting atmosphere of Mexican Gothic with the dreamy enchantment of The Invisible Life of Addie LaRue, The Last Tale of the Flower Bride is a spellbinding and darkly romantic page-turner about love and lies, secrets and betrayal, and the stories we tell ourselves to survive.",
        "pages": 304,
        "publisher": "William Morrow & Company",
        "publishedDate": "February 14, 2023",
        "author": "Roshani Chokshi",
        "title": "The Last Tale of the Flower Bride",
        "tags": [
            "Fantasy",
            "Gothic",
            "Adult",
            "Horror",
            "Romance",
            "Fiction",
            "Mystery",
            "Thriller",
            "Mystery Thriller",
            "Adult Fiction"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1655508932i/60147395.jpg",
        "description": "Arthur C. Clarke winner and Sunday Times bestseller Adrian Tchaikovsky's triumphant return to fantasy with a darkly inventive portrait of a city under occupation and on the verge of revolution.\n\nThere has always been a darkness to Ilmar, but never more so than now. The city chafes under the heavy hand of the Palleseen occupation, the choke-hold of its criminal underworld, the boot of its factory owners, the weight of its wretched poor and the burden of its ancient curse.\nWhat will be the spark that lights the conflagration?\nDespite the city's refugees, wanderers, murderers, madmen, fanatics and thieves, the catalyst, as always, will be the Anchorwood – that dark grove of trees, that primeval remnant, that portal, when the moon is full, to strange and distant shores.\n\nIlmar, some say, is the worst place in the world and the gateway to a thousand worse places.\n\nIlmar,\nCity of Long Shadows.\nCity of Bad Decisions.\nCity of Last Chances.",
        "pages": 512,
        "publisher": "Head of Zeus",
        "publishedDate": "December 8, 2022",
        "author": "Adrian Tchaikovsky",
        "title": "City of Last Chances",
        "tags": [
            "Fantasy",
            "Epic Fantasy",
            "Fiction",
            "Adult",
            "Science Fiction",
            "Science Fiction Fantasy",
            "Dystopia",
            "Dark Fantasy",
            "Magic",
            "Epic"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1653220923i/60321139.jpg",
        "description": "The Immortality Thief is a ridiculously fun, fast paced, seat-of-your-pants read full of treasure hunts, traps, deadly enemies, betrayal, secrets, mysterious aliens, adventure and action as the story races to the find the secret to immortality.\n\nFar off the edge of human existence, beside a dying star lies a nameless ship abandoned and hidden, lost for a millennium. But there are secrets there, terrible secrets that would change the fate of humanity, and eventually someone will come looking.\n\nRefugee, criminal and linguist Sean Wren is made an offer he knows he can’t refuse: life in prison, “voluntary” military service – or salvaging data in a long-dead language from an abandoned ship filled with traps and monsters, just days before it’s destroyed in a supernova. Data connected to the Philosopher’s Stone experiments, into unlocking the secrets of immortality.\n\nAnd he’s not the only one looking for the derelict ship. The Ministers, mysterious undying aliens that have ruled over humanity for centuries, want the data – as does The Republic, humanity’s last free government. And time is running out.\n\nIn the bowels of the derelict ship, surrounded by horrors and dead men, Sean slowly uncovers the truth of what happened on the ship, in its final days… and the terrible secret it’s hiding.",
        "pages": 608,
        "publisher": "Solaris",
        "publishedDate": "October 11, 2022",
        "author": "Taran Hunt",
        "title": "The Immortality Thief",
        "tags": [
            "Science Fiction",
            "Space Opera",
            "Horror",
            "Aliens",
            "Space",
            "Adult",
            "Fantasy",
            "Speculative Fiction",
            "Mystery",
            "Fiction"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1634486353i/59365820.jpg",
        "description": "Fleeing the final days of the generations-long war with the alien Felen, smuggler Jereth Keeven's freighter the Jonah breaks down in a strange rift in deep space, with little chance of rescue—until they encounter the research vessel Gallion, which claims to be from 152 years in the future.\n\nThe Gallion's chief engineer Uma Ozakka has always been fascinated with the past, especially the tale of the Fortunate Five, who ended the war with the Felen. When the Gallion rescues a run-down junk freighter, Ozakka is shocked to recognize the Five's legendary ship—and the Five's famed leader, Eldric Leesongronski, among the crew.\n\nBut nothing else about Leesongronski and his crewmates seems to match up with the historical record. With their ships running out of power in the rift, more than the lives of both crews may be at stake.",
        "pages": 480,
        "publisher": "Solaris",
        "publishedDate": "June 7, 2022",
        "author": "Ren Hutchings",
        "title": "Under Fortunate Stars",
        "tags": [
            "Science Fiction",
            "Space Opera",
            "Time Travel",
            "Fiction",
            "Queer",
            "LGBT",
            "Adult",
            "Space",
            "Science Fiction Fantasy",
            "Adventure"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1653220923i/60321139.jpg",
        "description": "The Immortality Thief is a ridiculously fun, fast paced, seat-of-your-pants read full of treasure hunts, traps, deadly enemies, betrayal, secrets, mysterious aliens, adventure and action as the story races to the find the secret to immortality.\n\nFar off the edge of human existence, beside a dying star lies a nameless ship abandoned and hidden, lost for a millennium. But there are secrets there, terrible secrets that would change the fate of humanity, and eventually someone will come looking.\n\nRefugee, criminal and linguist Sean Wren is made an offer he knows he can’t refuse: life in prison, “voluntary” military service – or salvaging data in a long-dead language from an abandoned ship filled with traps and monsters, just days before it’s destroyed in a supernova. Data connected to the Philosopher’s Stone experiments, into unlocking the secrets of immortality.\n\nAnd he’s not the only one looking for the derelict ship. The Ministers, mysterious undying aliens that have ruled over humanity for centuries, want the data – as does The Republic, humanity’s last free government. And time is running out.\n\nIn the bowels of the derelict ship, surrounded by horrors and dead men, Sean slowly uncovers the truth of what happened on the ship, in its final days… and the terrible secret it’s hiding.",
        "pages": 608,
        "publisher": "Solaris",
        "publishedDate": "October 11, 2022",
        "author": "Taran Hunt",
        "title": "The Immortality Thief",
        "tags": [
            "Science Fiction",
            "Space Opera",
            "Horror",
            "Aliens",
            "Space",
            "Adult",
            "Fantasy",
            "Speculative Fiction",
            "Mystery",
            "Fiction"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660752937i/60321513.jpg",
        "description": "Remy Pendergast is many things: the only son of the Duke of Valenbonne (though his father might wish otherwise), an elite bounty hunter of rogue vampires, and an outcast among his fellow Reapers. His mother was the subject of gossip even before she eloped with a vampire, giving rise to the rumors that Remy is half-vampire himself. Though the kingdom of Aluria barely tolerates him, Remy’s father has been shaping him into a weapon to fight for the kingdom at any cost.\n\nWhen a terrifying new breed of vampire is sighted outside of the city, Remy prepares to investigate alone. But then he encounters the shockingly warmhearted vampire heiress Xiaodan Song and her infuriatingly arrogant fiancé, vampire lord Zidan Malekh, who may hold the key to defeating the creatures—though he knows associating with them won’t do his reputation any favors. When he’s offered a spot alongside them to find the truth about the mutating virus Rot that’s plaguing the kingdom, Remy faces a choice.\n\nIt’s one he’s certain he’ll regret.\n\nBut as the three face dangerous hardships during their journey, Remy develops fond and complicated feelings for the couple. He begins to question what he holds true about vampires, as well as the story behind his own family legacy. As the Rot continues to spread across the kingdom, Remy must decide where his loyalties lie: with his father and the kingdom he’s been trained all his life to defend or the vampires who might just be the death of him.",
        "pages": 512,
        "publisher": "Gallery / Saga Press",
        "publishedDate": "September 13, 2022",
        "author": "Rin Chupeco",
        "title": "Silver Under Nightfall",
        "tags": [
            "Fantasy",
            "LGBT",
            "Adult",
            "Vampires",
            "Horror",
            "Romance",
            "Paranormal",
            "Queer",
            "Fiction",
            "Gothic"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1586722975i/2767052.jpg",
        "description": "Could you survive on your own in the wild, with every one out to make sure you don't live to see the morning?\n\nIn the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV.\n\nSixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before—and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weight survival against humanity and life against love.",
        "pages": 374,
        "publisher": "Scholastic Press",
        "publishedDate": "October 14, 2008",
        "author": "Suzanne Collins",
        "title": "The Hunger Games",
        "tags": [
            "Young Adult",
            "Fiction",
            "Dystopia",
            "Fantasy",
            "Science Fiction",
            "Romance",
            "Adventure",
            "Teen",
            "Post Apocalyptic",
            "Audiobook"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1618526890i/13335037.jpg",
        "description": "In Beatrice Prior's dystopian Chicago world, society is divided into five factions, each dedicated to the cultivation of a particular virtue—Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is—she can't have both. So she makes a choice that surprises everyone, including herself.\n\nDuring the highly competitive initiation that follows, Beatrice renames herself Tris and struggles alongside her fellow initiates to live out the choice they have made. Together they must undergo extreme physical tests of endurance and intense psychological simulations, some with devastating consequences. As initiation transforms them all, Tris must determine who her friends really are—and where, exactly, a romance with a sometimes fascinating, sometimes exasperating boy fits into the life she's chosen. But Tris also has a secret, one she's kept hidden from everyone because she's been warned it can mean death. And as she discovers unrest and growing conflict that threaten to unravel her seemingly perfect society, she also learns that her secret might help her save those she loves . . . or it might destroy her.",
        "pages": 487,
        "publisher": "Katherine Tegen Books",
        "publishedDate": "February 28, 2012",
        "author": "Veronica Roth",
        "title": "Divergent",
        "tags": [
            "Young Adult",
            "Dystopia",
            "Fiction",
            "Fantasy",
            "Science Fiction",
            "Romance",
            "Adventure",
            "Teen",
            "Action",
            "Post Apocalyptic"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660273739i/11870085.jpg",
        "description": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.\n\nInsightful, bold, irreverent, and raw, The Fault in Our Stars is award-winning author John Green's most ambitious and heartbreaking work yet, brilliantly exploring the funny, thrilling, and tragic business of being alive and in love.",
        "pages": 313,
        "publisher": "Dutton Books",
        "publishedDate": "January 10, 2012",
        "author": "John Green",
        "title": "The Fault in Our Stars",
        "tags": [
            "Young Adult",
            "Romance",
            "Fiction",
            "Contemporary",
            "Realistic Fiction",
            "Teen",
            "Coming Of Age",
            "Novels",
            "Drama",
            "Love"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1546071216i/5907.jpg",
        "description": "In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.\nWritten for J.R.R. Tolkien’s own children, The Hobbit met with instant critical acclaim when it was first published in 1937. Now recognized as a timeless classic, this introduction to the hobbit Bilbo Baggins, the wizard Gandalf, Gollum, and the spectacular world of Middle-earth recounts of the adventures of a reluctant hero, a powerful and dangerous ring, and the cruel dragon Smaug the Magnificent. The text in this 372-page paperback edition is based on that first published in Great Britain by Collins Modern Classics (1998), and includes a note on the text by Douglas A. Anderson (2001).",
        "pages": 366,
        "publisher": "Houghton Mifflin",
        "publishedDate": "August 15, 2002",
        "author": "J.R.R. Tolkien",
        "title": "The Hobbit",
        "tags": [
            "Fantasy",
            "Classics",
            "Fiction",
            "Adventure",
            "Young Adult",
            "Science Fiction Fantasy",
            "High Fantasy",
            "Childrens",
            "Epic Fantasy",
            "Novels"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1347803870i/119.jpg",
        "description": "With complete and unrestricted access to artwork created over a five-year period, this authoritative and insightful book illustrates the creative development of The Fellowship of the Ring. This official publication contains 500 exclusive images, from the earliest pencil sketches and conceptual drawings to magnificent full-color paintings that shaped the look of the film. All the principal locations, costumes, armor and creatures are covered in stunning detail, including concepts, storyboards and images that did not make it into the final film.\n\n\nAs well as a wealth of sketches, paintings and digital images, The Art of The Fellowship of the Ring contains photographs showing how the creative process was realized and a number of stills from the film. Contributors include Alan Lee and John Howe, the two artists who inspired Peter Jackson's vision of Middle-earth and who worked with him to bring his trilogy to the big screen. They and a dozen other designers who created all of these diverse elements explain how they contributed to the development of the film, giving a fascinating insight into how Middle-earth was brought to life.\n\n\nWith text compiled from exclusive interviews with director Peter Jackson, special effects supervisor Richard Taylor, designers Grant Major, Ngila Dickson, Paul Lasaine and others, this unique book celebrates the pivotal contribution made by a handful of people which help turn the first Lord of the Rings movie into an award-winning global success.",
        "pages": 192,
        "publisher": "Houghton Mifflin Harcourt",
        "publishedDate": "June 12, 2002",
        "author": "Gary Russell",
        "title": "The Lord of the Rings: The Art of the Fellowship of the Ring",
        "tags": [
            "Fantasy",
            "Art",
            "Fiction",
            "Classics",
            "Film",
            "Media Tie In",
            "High Fantasy",
            "Adventure",
            "Science Fiction Fantasy",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1388290346i/36.jpg",
        "description": "Lavishly illustrated with 1,000 photos, paintings, maps, sculptures and sketches, most appearing here for the first time, Weapons and Warfare is an indispensable chronicle of The Lord of the Rings' many creatures, warriors, armies and battlegrounds. From the graceful and proficient Elves to the horrendous war machines of the Dark Lord, each culture's approach to warfare is explained - how they fought, why they were fighting, what armor they wore and what weapons they used against their enemies. Now you can get as close to a marauding Orc as you could ever wish, without suffering the consequences!\n\nTreating the filmmakers' notes, designs and props as a true archive, Weapons and Warfare describes in detail every major conflict depicted in the film trilogy - from The Last Alliance of Elves and Men to the climactic Battle of the Pelennor Fields - each accompanied by a battle diagram from the films' chief designers.\n\nArmed with a wealth of fascinating facts and unique imagery, and with an exclusive foreword by Christopher Lee and an introduction by the Academy Award winner Richard Taylor, Weapons and Warfare promises to be the most striking companion to The Lord of the Rings movie trilogy published to date.",
        "pages": 218,
        "publisher": "Houghton Mifflin Harcourt",
        "publishedDate": "November 5, 2003",
        "author": "Chris Smith",
        "title": "The Lord of the Rings: Weapons and Warfare",
        "tags": [
            "Fantasy",
            "Art",
            "Fiction",
            "Reference",
            "Media Tie In",
            "Film",
            "Classics",
            "Adventure",
            "High Fantasy",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1630657083i/15222.jpg",
        "description": "Houghton Mifflin is proud to present a full-color, large-format, guide to the characters, cultures, and locations of J.R.R. Tolkien's extraordinary creation Middle-earth, as depicted in the movie The Fellowship of the Ring - the first of three blockbuster films from New Line Cinema. Filled with stunning imagery and with a thorough, informative narrative text, The Fellowship of the Ring Visual Companion will provide the reader with a rich feast of detail and information. Featuring exclusive photos of Frodo, Gandalf, the Ringwraiths, elves, and all the other main characters and creatures of the first film, the book also includes breathtaking pictures of Hobbiton, Rivendell, and Moria.\nThe first of a projected three-book series that no Tolkien fan, from novice to expert, should be without, The Fellowship of the Ring Visual Companion contains a special eight-page gatefold of large-format images unique to this book.\n",
        "pages": 72,
        "publisher": "Houghton Mifflin Harcourt",
        "publishedDate": "November 6, 2001",
        "author": "Jude Fisher",
        "title": "The Lord of the Rings: The Fellowship of the Ring: Visual Companion",
        "tags": [
            "Fantasy",
            "Fiction",
            "Art",
            "Film",
            "Reference",
            "Media Tie In",
            "Classics",
            "Picture Books",
            "Science Fiction Fantasy",
            "Photography"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1346542140i/14833682.jpg",
        "description": "This official tie-in photo guidebook is packed with exclusive photographs and in-depth text offering a sneak peek at the highly anticipated new film The Hobbit: An Unexpected Journey, directed by Peter Jackson.\n\nJoin the hobbit, Bilbo Baggins, Gandalf the wizard and the Company of Dwarves on their Quest to recover treasure stolen by the Dragon, Smaug the Magnificent. Leaving the comfort of Bilbo’s home they must face many perils before they can claim their long-lost gold -- Trolls, Elves, Goblins, Wargs, and worse…\n\nRichly illustrated with more than 100 color photos from the film, and featuring a brand new fold-out map charting the journey from Bag End to Wilderland, The Hobbit: An Unexpected Journey Visual Companion begins the Quest for the Lonely Mountain in spectacular style.",
        "pages": 72,
        "publisher": "Houghton Mifflin Harcourt",
        "publishedDate": "November 6, 2012",
        "author": "Jude Fisher",
        "title": "The Hobbit: An Unexpected Journey - Visual Companion",
        "tags": [
            "Fantasy",
            "Film",
            "Fiction",
            "Art",
            "Media Tie In",
            "Adventure",
            "Dragons",
            "Reference"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1586722918i/7260188.jpg",
        "description": "My name is Katniss Everdeen.\nWhy am I not dead?\nI should be dead.\n\nKatniss Everdeen, girl on fire, has survived, even though her home has been destroyed. Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.\n\nIt is by design that Katniss was rescued from the arena in the cruel and haunting Quarter Quell, and it is by design that she has long been part of the revolution without knowing it. District 13 has come out of the shadows and is plotting to overthrow the Capitol. Everyone, it seems, has had a hand in the carefully laid plans—except Katniss.\n\nThe success of the rebellion hinges on Katniss's willingness to be a pawn, to accept responsibility for countless lives, and to change the course of the future of Panem. To do this, she must put aside her feelings of anger and distrust. She must become the rebels' Mockingjay—no matter what the personal cost.",
        "pages": 398,
        "publisher": "Scholastic Press",
        "publishedDate": "August 24, 2010",
        "author": "Suzanne Collins",
        "title": "Mockingjay",
        "tags": [
            "Young Adult",
            "Dystopia",
            "Fiction",
            "Fantasy",
            "Science Fiction",
            "Romance",
            "Adventure",
            "Teen",
            "Post Apocalyptic",
            "Audiobook"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1618525340i/11735983.jpg",
        "description": "One choice can transform you—or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love.\n\nTris's initiation day should have been marked by celebration and victory with her chosen faction; instead, the day ended with unspeakable horrors. War now looms as conflict between the factions and their ideologies grows. And in times of war, sides must be chosen, secrets will emerge, and choices will become even more irrevocable—and even more powerful. Transformed by her own decisions but also by haunting grief and guilt, radical new discoveries, and shifting relationships, Tris must fully embrace her Divergence, even if she does not know what she may lose by doing so.\n\nNew York Times bestselling author Veronica Roth's much-anticipated second book of the dystopian DIVERGENT series is another intoxicating thrill ride of a story, rich with hallmark twists, heartbreaks, romance, and powerful insights about human nature.",
        "pages": 525,
        "publisher": "HarperCollins Children's Books",
        "publishedDate": "May 1, 2012",
        "author": "Veronica Roth",
        "title": "Insurgent",
        "tags": [
            "Young Adult",
            "Dystopia",
            "Fiction",
            "Fantasy",
            "Science Fiction",
            "Romance",
            "Adventure",
            "Teen",
            "Post Apocalyptic",
            "Audiobook"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1375596592i/6186357.jpg",
        "description": "There are alternate cover editions for this ASIN here and here.\n\nIf you ain’t scared, you ain’t human.\n\nWhen Thomas wakes up in the lift, the only thing he can remember is his name. He’s surrounded by strangers—boys whose memories are also gone.\n\nNice to meet ya, shank. Welcome to the Glade.\n\nOutside the towering stone walls that surround the Glade is a limitless, ever-changing maze. It’s the only way out—and no one’s ever made it through alive.\n\nEverything is going to change.\n\nThen a girl arrives. The first girl ever. And the message she delivers is terrifying.\n\nRemember. Survive. Run.",
        "pages": 384,
        "publisher": "Delacorte Press",
        "publishedDate": "October 6, 2009",
        "author": "James Dashner",
        "title": "The Maze Runner",
        "tags": [
            "Young Adult",
            "Dystopia",
            "Science Fiction",
            "Fiction",
            "Fantasy",
            "Adventure",
            "Post Apocalyptic",
            "Mystery",
            "Teen",
            "Audiobook"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1427674948i/23452896.jpg",
        "description": "Escaping the Maze was only the beginning.\n\nThe world thought it had seen the worst after the Sun Flares struck the Earth’s surface, and millions of people were killed. But then an unstoppable illness ravaged the bodies and minds of the remaining survivors. Simply known as the Flare, the disease seemed unstoppable until a cure was discovered, but that relief came at a human cost.\n\nNow it's up to Thomas, Teresa and the others, who will discover that while they may have escaped the Maze, they've entered into an experiment more terrifying than anything they could imagine. Explore how the terrifying W.C.K.D. came to be, and how the very first Maze was designed. Discover what it takes to survive in a post-Flare world, against the violent Cranks that have begun to take over humanity, only to learn that the Glade may not be the only Maze W.C.K.D. was running.\n\nWith over 6.5 million books in print, and an international hit film series, it’s plain to see fans lost themselves in James Dashner’s bestselling series. Featuring an introduction from Dashner himself, this collection of all new short stories reveals the hidden histories of your favorite Gladers, including Aris, Ava Paige, and Mary Cooper before The Scorch Trials hits theaters on September 18.",
        "pages": 96,
        "publisher": "KaBOOM!",
        "publishedDate": "June 23, 2015",
        "author": "Jackson Lanzing",
        "title": "Maze Runner: The Scorch Trials: The Official Graphic Novel Prelude",
        "tags": [
            "Dystopia",
            "Young Adult",
            "Graphic Novels",
            "Fiction",
            "Science Fiction",
            "Fantasy",
            "Comics",
            "Post Apocalyptic",
            "Action",
            "Mystery"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1508955737i/25987085.jpg",
        "description": "An all new, original Maze Runner story set directly before the upcoming third film, The Death Cure.  \n\nThey used to live and die by the Maze—a seemingly endless labyrinth of deathtraps that kept the Gladers prisoner and in fear. But the day Thomas arrived, he motivated them all to push back...and escape.\n\nBut what they discovered was far worse than any maze—a world scorched by disease and controlled by the oppressive organization, Wicked. Thomas, Aided by a band of rebels, now readies to take the fight right to Wicked’s doorstep in the hope of finding a cure for the plague that’s ravaging mankind.\n\nThis all-new, authorized graphic novel bridges the gap between the second and third installments (Scorch Trials, The Death Cure) of the hit film franchise, The Maze Runner.",
        "pages": 96,
        "publisher": "KaBOOM!",
        "publishedDate": "November 14, 2017",
        "author": "Eric Carrasco",
        "title": "Maze Runner: The Death Cure: The Official Graphic Novel Prelude",
        "tags": [
            "Dystopia",
            "Young Adult",
            "Science Fiction",
            "Graphic Novels",
            "Fiction",
            "Fantasy",
            "Comics",
            "Action",
            "Childrens",
            "Teen"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1593892032i/51901147.jpg",
        "description": "It is the morning of the reaping that will kick off the tenth annual Hunger Games. In the Capital, eighteen-year-old Coriolanus Snow is preparing for his one shot at glory as a mentor in the Games. The once-mighty house of Snow has fallen on hard times, its fate hanging on the slender chance that Coriolanus will be able to outcharm, outwit, and outmaneuver his fellow students to mentor the winning tribute.\n\nThe odds are against him. He's been given the humiliating assignment of mentoring the female tribute from District 12, the lowest of the low. Their fates are now completely intertwined -- every choice Coriolanus makes could lead to favor or failure, triumph or ruin. Inside the arena, it will be a fight to the death. Outside the arena, Coriolanus starts to feel for his doomed tribute... and must weigh his need to follow the rules against his desire to survive no matter what it takes.",
        "pages": 541,
        "publisher": "Scholastic Press",
        "publishedDate": "May 19, 2020",
        "author": "Suzanne Collins",
        "title": "The Ballad of Songbirds and Snakes",
        "tags": [
            "Young Adult",
            "Dystopia",
            "Fiction",
            "Fantasy",
            "Science Fiction",
            "Audiobook",
            "Romance",
            "Adventure",
            "Teen",
            "Science Fiction Fantasy"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1465002076i/30346601.jpg",
        "description": "One teen’s incredible journey may just blow his father’s mind…\n\nFourteen-year-old Bernard thinks outside the box. The only problem is that neither his school nor his ultra-rational physicist father appreciate his unique ideas. When he reacts to a stressful situation at school by mooning the class, his suspension sends him straight to his father’s workplace. After his frustrated father leaves him unattended, Bernard does what any teen would do: wander into the particle accelerator and accidentally get transported through a wormhole!\n\nIt doesn’t take long for Bernard to realize he’s in deep trouble. Not only did the wormhole drop him in the middle of a civil war over a depleted resource, but the battle is actually taking place inside his father’s brain. Bernard has one chance to save the dying side of his father’s creative brain from the tyrannical left side. Can he use his outside-the-box thinking to save his father’s life?\n\nBrainwalker is a young adult sci-fi fantasy novel that turns the world of neuroscience on its head. If you like incredible fantasy worlds, fast-paced entertainment, and the human mind, then you’ll love Robyn Mundell and Stephan Lacast’s amazing journey inside the brain.\n\nBuy Brainwalker to help the mind survive today!",
        "pages": 260,
        "publisher": "Dualmind Publishing",
        "publishedDate": "October 1, 2016",
        "author": "Robyn Mundell",
        "title": "Brainwalker",
        "tags": [
            "Fantasy",
            "Young Adult",
            "Childrens",
            "Middle Grade",
            "Adventure",
            "Science Fiction Fantasy",
            "Fiction",
            "Young Adult Fantasy",
            "Science Fiction",
            "New Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1549002227i/35965828.jpg",
        "description": "Some secrets are deadly.\n\nIt's no secret that Sundew wants to destroy the HiveWings. It's her life's mission to exact revenge on the tribe that tried to wipe out the LeafWings and ripped every tree from the surface of Pantala.\n\nEvery tree, that is, except the wild and dangerous Poison Jungle, where the surviving LeafWings have been hiding since the war. Hiding, plotting, and waiting for a dragon like Sundew, who is uniquely qualified to bring down the Hives.\n\nThere are dark secrets in the jungle, though-some that Sundew is keeping, and some that she's only just beginning to discover. And now that a new war is upon them, Sundew and her friends must unearth the oldest secret in the jungle-even if what they find has the power to destroy them all.",
        "pages": 336,
        "publisher": "Scholastic Press",
        "publishedDate": "June 25, 2019",
        "author": "Tui T. Sutherland",
        "title": "The Poison Jungle",
        "tags": [
            "Fantasy",
            "Middle Grade",
            "Dragons",
            "Adventure",
            "Young Adult",
            "Childrens",
            "Young Adult Fantasy",
            "Science Fiction Fantasy",
            "Fiction",
            "Audiobook"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1467121158i/30226723.jpg",
        "description": "In this breathless third installment to Victoria Aveyard’s bestselling Red Queen series, allegiances are tested on every side. And when the Lightning Girl's spark is gone, who will light the way for the rebellion?\n\nMare Barrow is a prisoner, powerless without her lightning, tormented by her lethal mistakes. She lives at the mercy of a boy she once loved, a boy made of lies and betrayal. Now a king, Maven Calore continues weaving his dead mother's web in an attempt to maintain control over his country—and his prisoner.\n\nAs Mare bears the weight of Silent Stone in the palace, her once-ragtag band of newbloods and Reds continue organizing, training, and expanding. They prepare for war, no longer able to linger in the shadows. And Cal, the exiled prince with his own claim on Mare's heart, will stop at nothing to bring her back.\n\nWhen blood turns on blood, and ability on ability, there may be no one left to put out the fire—leaving Norta as Mare knows it to burn all the way down.",
        "pages": 528,
        "publisher": "HarperTeen",
        "publishedDate": "February 7, 2017",
        "author": "Victoria Aveyard",
        "title": "King's Cage",
        "tags": [
            "Fantasy",
            "Young Adult",
            "Dystopia",
            "Romance",
            "Fiction",
            "Young Adult Fantasy",
            "Audiobook",
            "Science Fiction",
            "Magic",
            "High Fantasy"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1553624975i/26032912.jpg",
        "description": "He will be destruction of the crown and the ruination of the throne.\n\nPower is much easier to acquire than it is to hold onto. Jude learned this lesson when she released her control over the wicked king, Cardan, in exchange for immeasurable power.\n\nNow as the exiled mortal Queen of Faerie, Jude is powerless and left reeling from Cardan’s betrayal. She bides her time determined to reclaim everything he took from her. Opportunity arrives in the form of her deceptive twin sister, Taryn, whose mortal life is in peril.\n\nJude must risk venturing back into the treacherous Faerie Court, and confront her lingering feelings for Cardan, if she wishes to save her sister. But Elfhame is not as she left it. War is brewing. As Jude slips deep within enemy lines she becomes ensnared in the conflict’s bloody politics.\n\nAnd, when a dormant yet powerful curse is unleashed, panic spreads throughout the land, forcing her to choose between her ambition and her humanity…\n\nFrom the #1 New York Times bestselling author Holly Black, comes the highly anticipated and jaw-dropping finale to The Folk of the Air trilogy.",
        "pages": 300,
        "publisher": "Little, Brown",
        "publishedDate": "November 19, 2019",
        "author": "Holly Black",
        "title": "The Queen of Nothing",
        "tags": [
            "Fantasy",
            "Young Adult",
            "Romance",
            "Fae",
            "Young Adult Fantasy",
            "Fiction",
            "Magic",
            "Audiobook",
            "Fantasy Romance",
            "Fairies"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1340287622i/13104080.jpg",
        "description": "The thrilling second installment in New York Times bestselling author Tahereh Mafi’s Shatter Me series.\n\nIt should have taken Juliette a single touch to kill Warner. But his mysterious immunity to her deadly power has left her shaken, wondering why her ultimate defense mechanism failed against the person she most needs protection from.\n\nShe and Adam were able to escape Warner’s clutches and join up with a group of rebels, many of whom have powers of their own. Juliette will finally be able to actively fight against The Reestablishment and try to fix her broken world. And perhaps these new allies can help her shed light on the secret behind Adam’s—and Warner’s—immunity to her killer skin.\n\nJuliette’s world is packed with high-stakes action and tantalizing romance, perfect for fans of the Red Queen series by Victoria Aveyard and the Darkest Minds trilogy by Alexandra Bracken.\n\nRansom Riggs, #1 New York Times bestselling author of Miss Peregrine's Home for Peculiar Children, raved: \"A thrilling, high-stakes saga of self-discovery and forbidden love, the Shatter Me series is a must-read for fans of dystopian young-adult literature—or any literature!\"",
        "pages": 461,
        "publisher": "HarperCollins",
        "publishedDate": "February 5, 2013",
        "author": "Tahereh Mafi",
        "title": "Unravel Me",
        "tags": [
            "Dystopia",
            "Young Adult",
            "Fantasy",
            "Romance",
            "Science Fiction",
            "Paranormal",
            "Fiction",
            "Young Adult Fantasy",
            "New Adult",
            "Audiobook"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1610493390i/50531218.jpg",
        "description": "Intrigue, riches, and romance abound in this thrilling sequel to the New York Times bestselling The Inheritance Games perfect for fans of Karen McManus and Holly Jackson.\n\nThe Inheritance Games ended with a bombshell, and now heiress Avery Grambs has to pick up the pieces and find the man who might hold the answers to all of her questions - including why Tobias Hawthorne left his entire fortune to Avery, a virtual stranger, rather than to his own daughters or grandsons.\n\nThanks to a DNA test, Avery knows that she's not a Hawthorne by blood, but clues pile up hinting at a deeper connection to the family than she had ever imagined. As the mystery grows and the plot thickens, Grayson and Jameson, the enigmatic and magnetic Hawthorne grandsons, continue to pull Avery in different directions. And there are threats lurking around every corner, as adversaries emerge who will stop at nothing to see Avery out of the picture - by any means necessary.\n\nWith nonstop action, aspirational jet-setting, family intrigue, swoonworthy romance, and billions of dollars hanging in the balance, The Hawthorne Legacy will thrill Jennifer Lynn Barnes fans and new readers alike.",
        "pages": 380,
        "publisher": "Penguin",
        "publishedDate": "September 7, 2021",
        "author": "Jennifer Lynn Barnes",
        "title": "The Hawthorne Legacy",
        "tags": [
            "Mystery",
            "Young Adult",
            "Romance",
            "Fiction",
            "Contemporary",
            "Mystery Thriller",
            "Thriller",
            "Fantasy",
            "Audiobook",
            "Adventure"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1623112782i/56905097.jpg",
        "description": "THE NEW YORK TIMES BESTSELLING SERIES\nThe highly-anticipated finale to the A Good Girl's Guide to Murder series, the instant bestsellers that read like your favorite true crime podcast or show. By the end of this mystery series, you'll never think of good girls the same way again...\n\nPip is about to head to college, but she is still haunted by the way her last investigation ended. She’s used to online death threats in the wake of her viral true-crime podcast, but she can’t help noticing an anonymous person who keeps asking her: Who will look for you when you’re the one who disappears?\n\nSoon the threats escalate and Pip realizes that someone is following her in real life. When she starts to find connections between her stalker and a local serial killer caught six years ago, she wonders if maybe the wrong man is behind bars.\n\nPolice refuse to act, so Pip has only one choice: find the suspect herself—or be the next victim. As the deadly game plays out, Pip discovers that everything in her small town is coming full circle . . .and if she doesn’t find the answers, this time she will be the one who disappears. . .",
        "pages": 459,
        "publisher": "Delacorte Press",
        "publishedDate": "September 28, 2021",
        "author": "Holly Jackson",
        "title": "As Good As Dead",
        "tags": [
            "Mystery",
            "Young Adult",
            "Thriller",
            "Mystery Thriller",
            "Fiction",
            "Contemporary",
            "Audiobook",
            "Crime",
            "Murder Mystery",
            "Romance"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1634068536i/58658940.jpg",
        "description": "Avery’s fortune, life, and loves are on the line in the game that everyone will be talking about.\n\nTo inherit billions, all Avery Kylie Grambs has to do is survive a few more weeks living in Hawthorne House. The paparazzi are dogging her every step. Financial pressures are building. Danger is a fact of life. And the only thing getting Avery through it all is the Hawthorne brothers. Her life is intertwined with theirs. She knows their secrets, and they know her.\n\nBut as the clock ticks down to the moment when Avery will become the richest teenager on the planet, trouble arrives in the form of a visitor who needs her help—and whose presence in Hawthorne House could change everything. It soon becomes clear that there is one last puzzle to solve, and Avery and the Hawthorne brothers are drawn into a dangerous game against an unknown and powerful player.\n\nSecrets upon secrets. Riddles upon riddles. In this game, there are hearts and lives at stake—and there is nothing more Hawthorne than winning.",
        "pages": 400,
        "publisher": "Little, Brown Books for Young Readers",
        "publishedDate": "August 30, 2022",
        "author": "Jennifer Lynn Barnes",
        "title": "The Final Gambit",
        "tags": [
            "Mystery",
            "Young Adult",
            "Romance",
            "Fiction",
            "Contemporary",
            "Mystery Thriller",
            "Fantasy",
            "Thriller",
            "Audiobook",
            "Adventure"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1639380109i/51559209.jpg",
        "description": "From the internationally bestselling author of Netflix's hottest new show, One of Us is Lying, comes a new, page-turning thriller . . .\n\nTrue crime can leave a false trail.\n\nFour years ago, Brynn left Saint Ambrose School following the shocking murder of her favourite teacher. The case was never solved, but she's sure that the three kids who found Mr. Larkin's body know more than they're telling, especially her ex-best friend Tripp Talbot. He's definitely hiding something.\n\nWhen Brynn gets an internship working on a popular true-crime show, she decides to investigate what really happened that day in the woods. But the further she dives into the past, the more secrets she finds.\n\nFour years ago someone got away with murder. Now it's time to uncover the truth . . .",
        "pages": 368,
        "publisher": "Delacorte Press",
        "publishedDate": "August 30, 2022",
        "author": "Karen M. McManus",
        "title": "Nothing More to Tell",
        "tags": [
            "Mystery",
            "Young Adult",
            "Thriller",
            "Mystery Thriller",
            "Fiction",
            "Contemporary",
            "Audiobook",
            "Crime",
            "Murder Mystery",
            "Romance"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1642779274i/59762456.jpg",
        "description": "Alice Lawrence is the sole witness in her sister’s murder trial.\n\nAnd in the year since Claire’s death, Alice’s life has completely fallen apart. Her parents have gotten divorced, she’s moved into an apartment that smells like bologna, and she is being forced to face her sister’s killer and a courtroom full of people who doubt what she saw in the corn maze a year prior.\n\nClaire was an all-American girl, beautiful and bubbly, and a theater star. Alice was a nerd who dreamed of becoming a forensic pathologist and would rather stay at home to watch her favorite horror movies than party. Despite their differences, they were bonded by sisterhood and were each other’s best friends.\n\nUntil Claire was taken away from her.\n\nOn the first day of the murder trial, as Alice prepares to give her testimony, she is knocked out by a Sidney Prescott look-alike in the courthouse bathroom. When she wakes up, it is Halloween morning a year earlier, the same day Claire was murdered. Alice has until midnight to save her sister and find the real killer before he claims another victim.",
        "pages": 299,
        "publisher": "Razorbill",
        "publishedDate": "August 30, 2022",
        "author": "Danielle Valentine",
        "title": "How to Survive Your Murder",
        "tags": [
            "Horror",
            "Young Adult",
            "Mystery",
            "Thriller",
            "Mystery Thriller",
            "Fiction",
            "Audiobook",
            "Contemporary",
            "Murder Mystery",
            "Halloween"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1664370443i/61313902.jpg",
        "description": "The brand new unmissable crime thriller from Holly Jackson, best-selling, award-winning author of the Good Girl’s Guide to Murder trilogy.\n\nEight hours.\nSix friends.\nOne sniper . . .\n\nEighteen year old Red and her friends are on a road trip in an RV, heading to the beach for Spring Break. It’s a long drive but spirits are high. Until the RV breaks down in the middle of nowhere. There’s no mobile phone reception and nobody around to help. And as the wheels are shot out, one by one, the friends realise that this is no accident. There’s a sniper out there in the dark watching them and he knows exactly who they are. One of the group has a secret that the sniper is willing to kill for.\n\nA game of cat-and-mouse plays out as the group desperately tries to get help and to work out which member of the group is the target. Buried secrets are forced to light in the cramped, claustrophobic setting of the RV, and tensions within the group will reach deadly levels. Not everyone will survive the night.",
        "pages": 391,
        "publisher": "Electric Monkey",
        "publishedDate": "December 8, 2022",
        "author": "Holly Jackson",
        "title": "Five Survive",
        "tags": [
            "Mystery",
            "Thriller",
            "Young Adult",
            "Mystery Thriller",
            "Contemporary",
            "Fiction",
            "Audiobook",
            "Crime",
            "Horror",
            "Murder Mystery"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1650735371i/60495147.jpg",
        "description": "Senior year at Ellingham Academy for Stevie Bell isn’t going well. Her boyfriend, David, is studying in London. Her friends are obsessed with college applications. With the cold case of the century solved, Stevie is adrift. There is nothing to distract her from the questions pinging around her brain—questions about college, love, and life in general.\n\nRelief comes when David invites Stevie and her friends to join him for study abroad, and his new friend Izzy introduces her to a double-murder cold case. In 1995, nine friends from Cambridge University went to a country house and played a drunken game of hide-and-seek. Two were found in the woodshed the next day, murdered with an ax.\n\nThe case was assumed to be a burglary gone wrong, but one of the remaining seven saw something she can’t explain. This was no break-in. Someone’s lying about what happened in the woodshed.\n\nSeven suspects. Two murders. One killer still playing a deadly game.",
        "pages": 464,
        "publisher": "Katherine Tegen Books",
        "publishedDate": "December 27, 2022",
        "author": "Maureen Johnson",
        "title": "Nine Liars",
        "tags": [
            "Mystery",
            "Young Adult",
            "Mystery Thriller",
            "Thriller",
            "Contemporary",
            "Fiction",
            "Audiobook",
            "Historical Fiction",
            "Romance",
            "Mental Health"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1668782119i/40097951.jpg",
        "description": "Alicia Berenson’s life is seemingly perfect. A famous painter married to an in-demand fashion photographer, she lives in a grand house with big windows overlooking a park in one of London’s most desirable areas. One evening her husband Gabriel returns home late from a fashion shoot, and Alicia shoots him five times in the face, and then never speaks another word.\n\nAlicia’s refusal to talk, or give any kind of explanation, turns a domestic tragedy into something far grander, a mystery that captures the public imagination and casts Alicia into notoriety. The price of her art skyrockets, and she, the silent patient, is hidden away from the tabloids and spotlight at the Grove, a secure forensic unit in North London.\n\nTheo Faber is a criminal psychotherapist who has waited a long time for the opportunity to work with Alicia. His determination to get her to talk and unravel the mystery of why she shot her husband takes him down a twisting path into his own motivations—a search for the truth that threatens to consume him....\n\nThe Silent Patient is a shocking psychological thriller of a woman’s act of violence against her husband—and of the therapist obsessed with uncovering her motive.",
        "pages": 325,
        "publisher": "Celadon Books",
        "publishedDate": "February 5, 2019",
        "author": "Alex Michaelides",
        "title": "The Silent Patient",
        "tags": [
            "Thriller",
            "Mystery",
            "Fiction",
            "Mystery Thriller",
            "Audiobook",
            "Suspense",
            "Crime",
            "Adult",
            "Psychological Thriller",
            "Contemporary"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1634158558i/59344312.jpg",
        "description": "Lowen Ashleigh is a struggling writer on the brink of financial ruin when she accepts the job offer of a lifetime. Jeremy Crawford, husband of bestselling author Verity Crawford, has hired Lowen to complete the remaining books in a successful series his injured wife is unable to finish.\n\nLowen arrives at the Crawford home, ready to sort through years of Verity's notes and outlines, hoping to find enough material to get her started. What Lowen doesn't expect to uncover in the chaotic office is an unfinished autobiography Verity never intended for anyone to read. Page after page of bone-chilling admissions, including Verity's recollection of what really happened the day her daughter died.\n\nLowen decides to keep the manuscript hidden from Jeremy, knowing its contents would devastate the already grieving father. But as Lowen's feelings for Jeremy begin to intensify, she recognizes all the ways she could benefit if he were to read his wife's words. After all, no matter how devoted Jeremy is to his injured wife, a truth this horrifying would make it impossible for him to continue to love her.",
        "pages": 336,
        "publisher": "Grand Central Publishing",
        "publishedDate": "October 5, 2021",
        "author": "Colleen Hoover",
        "title": "Verity",
        "tags": [
            "Thriller",
            "Romance",
            "Mystery",
            "Fiction",
            "Mystery Thriller",
            "Contemporary",
            "Suspense",
            "Adult",
            "Audiobook",
            "Dark"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1664458703i/32620332.jpg",
        "description": "Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now?\n\nMonique is not exactly on top of the world. Her husband has left her, and her professional life is going nowhere. Regardless of why Evelyn has selected her to write her biography, Monique is determined to use this opportunity to jumpstart her career.\n\nSummoned to Evelyn’s luxurious apartment, Monique listens in fascination as the actress tells her story. From making her way to Los Angeles in the 1950s to her decision to leave show business in the ‘80s, and, of course, the seven husbands along the way, Evelyn unspools a tale of ruthless ambition, unexpected friendship, and a great forbidden love. Monique begins to feel a very real connection to the legendary star, but as Evelyn’s story near its conclusion, it becomes clear that her life intersects with Monique’s own in tragic and irreversible ways.",
        "pages": 389,
        "publisher": "Atria Books",
        "publishedDate": "June 13, 2017",
        "author": "Taylor Jenkins Reid",
        "title": "The Seven Husbands of Evelyn Hugo",
        "tags": [
            "Fiction",
            "Historical Fiction",
            "Romance",
            "LGBT",
            "Contemporary",
            "Audiobook",
            "Adult",
            "Historical",
            "Queer",
            "Lesbian"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1470427482i/27362503.jpg",
        "description": "Sometimes it is the one who loves you who hurts you the most.\n\nLily hasn’t always had it easy, but that’s never stopped her from working hard for the life she wants. She’s come a long way from the small town in Maine where she grew up — she graduated from college, moved to Boston, and started her own business. So when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily’s life suddenly seems almost too good to be true.\n\nRyle is assertive, stubborn, maybe even a little arrogant. He’s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn’t hurt. Lily can’t get him out of her head. But Ryle’s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his “no dating” rule, she can’t help but wonder what made him that way in the first place.\n\nAs questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan — her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.",
        "pages": 386,
        "publisher": "Atria Books",
        "publishedDate": "August 2, 2016",
        "author": "Colleen Hoover",
        "title": "It Ends with Us",
        "tags": [
            "Romance",
            "Contemporary",
            "Fiction",
            "New Adult",
            "Contemporary Romance",
            "Adult",
            "Audiobook",
            "Abuse",
            "Chick Lit",
            "Young Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1661428846i/62080187.jpg",
        "description": "Newlyweds Tricia and Ethan are searching for the house of their dreams.\n\nBut when they visit the remote manor that once belonged to Dr. Adrienne Hale, a renowned psychiatrist who vanished without a trace four years earlier, a violent winter storm traps them at the estate… with no chance of escape until the blizzard comes to an end.\n\nIn search of a book to keep her entertained until the snow abates, Tricia happens upon a secret room. One that contains audio transcripts from every single patient Dr. Hale has ever interviewed. As Tricia listens to the cassette tapes, she learns about the terrifying chain of events leading up to Dr. Hale’s mysterious disappearance.\n\nTricia plays the tapes one by one, late into the night. With each one, another shocking piece of the puzzle falls into place, and Dr. Adrienne Hale’s web of lies slowly unravels.\n\nAnd then Tricia reaches the final cassette.\n\nThe one that reveals the entire horrifying truth.",
        "pages": 286,
        "publisher": "Hollywood Upstairs Press",
        "publishedDate": "September 19, 2022",
        "author": "Freida McFadden",
        "title": "Never Lie",
        "tags": [
            "Thriller",
            "Mystery",
            "Mystery Thriller",
            "Fiction",
            "Psychological Thriller",
            "Audiobook",
            "Suspense",
            "Crime",
            "Horror",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1659457434i/59947696.jpg",
        "description": "Can you stop a murder after it’s already happened?\n\nLate October. After midnight. You’re waiting up for your seventeen-year-old son. He’s late. As you watch from the window, he emerges, and you realize he isn’t alone: he’s walking toward a man, and he’s armed.\n\nYou can’t believe it when you see him do it: your funny, happy teenage son, he kills a stranger, right there on the street outside your house. You don’t know who. You don’t know why. You only know your son is now in custody. His future shattered.\n\nThat night you fall asleep in despair. All is lost. Until you wake... and it is yesterday.\n\nAnd then you wake again... and it is the day before yesterday.\n\nEvery morning you wake up a day earlier, another day before the murder. With another chance to stop it. Somewhere in the past lies an answer. The trigger for this crime—and you don’t have a choice but to find it...",
        "pages": 416,
        "publisher": "William Morrow",
        "publishedDate": "August 2, 2022",
        "author": "Gillian McAllister",
        "title": "Wrong Place Wrong Time",
        "tags": [
            "Thriller",
            "Mystery",
            "Fiction",
            "Mystery Thriller",
            "Audiobook",
            "Time Travel",
            "Suspense",
            "Science Fiction",
            "Crime",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1639604124i/59808050.jpg",
        "description": "The New York Times bestselling Queen of Twists returns…with a family reunion that leads to murder.\n\nAfter years of avoiding each other, Daisy Darker’s entire family is assembling for Nana’s 80th birthday party in Nana’s crumbling gothic house on a tiny tidal island. Finally back together one last time, when the tide comes in, they will be cut off from the rest of the world for eight hours.\n\nThe family arrives, each of them harboring secrets. Then at the stroke of midnight, as a storm rages, Nana is found dead. And an hour later, the next family member follows…\n\nTrapped on an island where someone is killing them one by one, the Darkers must reckon with their present mystery as well as their past secrets, before the tide comes in and all is revealed.\n\nWith a wicked wink to Agatha Christie’s And Then There Were None, Daisy Darker’s unforgettable twists will leave readers reeling.",
        "pages": 352,
        "publisher": "Flatiron Books",
        "publishedDate": "August 30, 2022",
        "author": "Alice Feeney",
        "title": "Daisy Darker",
        "tags": [
            "Mystery",
            "Thriller",
            "Mystery Thriller",
            "Fiction",
            "Audiobook",
            "Suspense",
            "Adult",
            "Horror",
            "Crime",
            "Contemporary"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1671400977i/59345249.jpg",
        "description": "April Coutts-Cliveden was the first person Hannah Jones met at Oxford.\n\nVivacious, bright, occasionally vicious, and the ultimate It girl, she quickly pulled Hannah into her dazzling orbit. Together, they developed a group of devoted and inseparable friends—Will, Hugh, Ryan, and Emily—during their first term. By the end of the second, April was dead.\n\nNow, a decade later, Hannah and Will are expecting their first child, and the man convicted of killing April, former Oxford porter John Neville, has died in prison. Relieved to have finally put the past behind her, Hannah’s world is rocked when a young journalist comes knocking and presents new evidence that Neville may have been innocent. As Hannah reconnects with old friends and delves deeper into the mystery of April’s death, she realizes that the friends she thought she knew all have something to hide… including a murder.\n\nThe #1 New York Times bestselling author of One by One returns with an unputdownable mystery following a woman on the search for answers a decade after her friend’s murder.\n\n",
        "pages": 423,
        "publisher": "Scout Press",
        "publishedDate": "July 12, 2022",
        "author": "Ruth Ware",
        "title": "The It Girl",
        "tags": [
            "Mystery",
            "Thriller",
            "Fiction",
            "Mystery Thriller",
            "Audiobook",
            "Suspense",
            "Adult",
            "Crime",
            "Contemporary",
            "Adult Fiction"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1659457434i/59947696.jpg",
        "description": "Can you stop a murder after it’s already happened?\n\nLate October. After midnight. You’re waiting up for your seventeen-year-old son. He’s late. As you watch from the window, he emerges, and you realize he isn’t alone: he’s walking toward a man, and he’s armed.\n\nYou can’t believe it when you see him do it: your funny, happy teenage son, he kills a stranger, right there on the street outside your house. You don’t know who. You don’t know why. You only know your son is now in custody. His future shattered.\n\nThat night you fall asleep in despair. All is lost. Until you wake... and it is yesterday.\n\nAnd then you wake again... and it is the day before yesterday.\n\nEvery morning you wake up a day earlier, another day before the murder. With another chance to stop it. Somewhere in the past lies an answer. The trigger for this crime—and you don’t have a choice but to find it...",
        "pages": 416,
        "publisher": "William Morrow",
        "publishedDate": "August 2, 2022",
        "author": "Gillian McAllister",
        "title": "Wrong Place Wrong Time",
        "tags": [
            "Thriller",
            "Mystery",
            "Fiction",
            "Mystery Thriller",
            "Audiobook",
            "Time Travel",
            "Suspense",
            "Science Fiction",
            "Crime",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1638425885i/16299.jpg",
        "description": "First, there were ten—a curious assortment of strangers summoned as weekend guests to a little private island off the coast of Devon. Their host, an eccentric millionaire unknown to all of them, is nowhere to be found. All that the guests have in common is a wicked past they're unwilling to reveal—and a secret that will seal their fate. For each has been marked for murder. A famous nursery rhyme is framed and hung in every room of the mansion:\n\n\"Ten little boys went out to dine; One choked his little self and then there were nine. Nine little boys sat up very late; One overslept himself and then there were eight. Eight little boys traveling in Devon; One said he'd stay there then there were seven. Seven little boys chopping up sticks; One chopped himself in half and then there were six. Six little boys playing with a hive; A bumblebee stung one and then there were five. Five little boys going in for law; One got in Chancery and then there were four. Four little boys going out to sea; A red herring swallowed one and then there were three. Three little boys walking in the zoo; A big bear hugged one and then there were two. Two little boys sitting in the sun; One got frizzled up and then there was one. One little boy left all alone; He went out and hanged himself and then there were none.\"\n\nWhen they realize that murders are occurring as described in the rhyme, terror mounts. One by one they fall prey. Before the weekend is out, there will be none. Who has choreographed this dastardly scheme? And who will be left to tell the tale? Only the dead are above suspicion.",
        "pages": 264,
        "publisher": "St. Martin's Press",
        "publishedDate": "May 3, 2004",
        "author": "Agatha Christie",
        "title": "And Then There Were None",
        "tags": [
            "Mystery",
            "Classics",
            "Fiction",
            "Crime",
            "Thriller",
            "Mystery Thriller",
            "Audiobook",
            "Adult",
            "Suspense",
            "Novels"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1486131451i/853510.jpg",
        "description": "Just after midnight, a snowdrift stops the famous Orient Express in its tracks as it travels through the mountainous Balkans. The luxurious train is surprisingly full for the time of the year but, by the morning, it is one passenger fewer. An American tycoon lies dead in his compartment, stabbed a dozen times, his door locked from the inside.\n\nOne of the passengers is none other than detective Hercule Poirot. On vacation.\n\nIsolated and with a killer on board, Poirot must identify the murderer—in case he or she decides to strike again.\n\nLibrarian's note: the first fifteen novels in the Hercule Poirot series are 1) The Mysterious Affair at Styles, 1920; 2) The Murder on the Links, 1923; 3) The Murder of Roger Ackroyd, 1926; 4) The Big Four, 1927; 5) The Mystery of the Blue Train, 1928; 6) Peril at End House, 1932; 7) Lord Edgware Dies, 1933; 8) Murder on the Orient Express, 1934; 9) Three Act Tragedy, 1935; 10) Death in the Clouds, 1935; 11) The A.B.C. Murders, 1936; 12) Murder in Mesopotamia, 1936; 13) Cards on the Table, 1936; 14) Dumb Witness, 1937; and 15) Death on the Nile, 1937. These are just the novels; Poirot also appears in this period in a play, Black Coffee, 1930, and two collections of short stories, Poirot Investigates, 1924, and Murder in the Mews, 1937. Each novel, play and short story has its own entry on Goodreads.",
        "pages": 274,
        "publisher": "HarperCollins",
        "publishedDate": "June 4, 2007",
        "author": "Agatha Christie",
        "title": "Murder on the Orient Express",
        "tags": [
            "Mystery",
            "Classics",
            "Fiction",
            "Crime",
            "Mystery Thriller",
            "Thriller",
            "Audiobook",
            "Detective",
            "Adult",
            "Murder Mystery"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1579621267i/968.jpg",
        "description": "ISBN 9780307277671 moved to this edition.\nWhile in Paris, Harvard symbologist Robert Langdon is awakened by a phone call in the dead of the night. The elderly curator of the Louvre has been murdered inside the museum, his body covered in baffling symbols. As Langdon and gifted French cryptologist Sophie Neveu sort through the bizarre riddles, they are stunned to discover a trail of clues hidden in the works of Leonardo da Vinci—clues visible for all to see and yet ingeniously disguised by the painter.\n\nEven more startling, the late curator was involved in the Priory of Sion—a secret society whose members included Sir Isaac Newton, Victor Hugo, and Da Vinci—and he guarded a breathtaking historical secret. Unless Langdon and Neveu can decipher the labyrinthine puzzle—while avoiding the faceless adversary who shadows their every move—the explosive, ancient truth will be lost forever.",
        "pages": 489,
        "publisher": "Anchor",
        "publishedDate": "March 28, 2006",
        "author": "Dan Brown",
        "title": "The Da Vinci Code",
        "tags": [
            "Fiction",
            "Mystery",
            "Thriller",
            "Mystery Thriller",
            "Historical Fiction",
            "Suspense",
            "Adventure",
            "Novels",
            "Crime",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1312019209i/612478.jpg",
        "description": "Is it a gesture of good will or a sinister trap that lures Rupert St. Vincent and his family to magnificent estate? How desperate is Joyce Lambert, a destitute young widow whose only recourse is to marry a man she despises? What unexpected circumstance stirs old loyalties in Theodora Darrell, and unfaithful wife about to run away with her lover? In this collection of short stories, the answers are as unexpected as they are satisfying. The Queen of Crime takes bizarre romantic entanglements, supernatural visitations, and classic murder to inventive new heights.\n\nContents:\nThe Listerdale Mystery\nThe Girl in the Train\nThe Manhood of Edward Robinson\nJane in Search of a Job\nA Fruitful Sunday\nThe Golden Ball\nThe Rajah's Emerald\nSwan Song\nThe Hound of Death\nThe Gypsy\nThe Lamp\nThe Strange Case of Sir Arthur Carmichael\nThe Call of Wings\nMagnolia Blossom\nNext to a Dog",
        "pages": 288,
        "publisher": "Minotaur Books",
        "publishedDate": "November 18, 2002",
        "author": "Agatha Christie",
        "title": "The Golden Ball and Other Stories",
        "tags": [
            "Mystery",
            "Short Stories",
            "Fiction",
            "Classics",
            "Crime",
            "Mystery Thriller",
            "British Literature",
            "Audiobook",
            "Murder Mystery",
            "Romance"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1389733983i/16322.jpg",
        "description": "When Alice Asher is murdered in Andover, Hercule Poirot is already looking into the clues. Alphabetically speaking, it's one letter down, twenty-five to go.\n\nThere's a serial killer on the loose. His macabre calling card is to leave the ABC Railway Guide beside each victim's body. But if A is for Alice Asher, bludgeoned to death in Andover, and B is for Betty Bernard, strangled with her belt on the beach at Bexhill, who will then be Victim C? More importantly, why is this happening?\n\nOften considered to be one of Agatha Christie's best.\n\nLibrarian's note: the first fifteen novels in the Hercule Poirot series are 1) The Mysterious Affair at Styles, 1920; 2) The Murder on the Links, 1923; 3) The Murder of Roger Ackroyd, 1926; 4) The Big Four, 1927; 5) The Mystery of the Blue Train, 1928; 6) Peril at End House, 1932; 7) Lord Edgware Dies, 1933; 8) Murder on the Orient Express, 1934; 9) Three Act Tragedy, 1935; 10) Death in the Clouds, 1935; 11) The A.B.C. Murders, 1936; 12) Murder in Mesopotamia, 1936; 13) Cards on the Table, 1936; 14) Dumb Witness, 1937; and 15) Death on the Nile, 1937. These are just the novels; Poirot also appears in this period in a play, Black Coffee, 1930, and two collections of short stories, Poirot Investigates, 1924, and Murder in the Mews, 1937. Each novel, play and short story has its own entry on Goodreads.",
        "pages": 232,
        "publisher": "Black Dog & Leventhal Publishers",
        "publishedDate": "September 1, 2006",
        "author": "Agatha Christie",
        "title": "The A.B.C. Murders",
        "tags": [
            "Mystery",
            "Fiction",
            "Classics",
            "Crime",
            "Mystery Thriller",
            "Detective",
            "Thriller",
            "Audiobook",
            "Murder Mystery",
            "British Literature"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1581427726i/51132354.jpg",
        "description": "When Hercule Poirot and his associate Arthur Hastings arrive in the French village of Merlinville-sur-Mer to meet their client Paul Renauld, they learn from the police that he has been found that morning stabbed in the back with a letter opener and left in a newly-dug grave adjacent to a local golf course.\n\nAmong the plausible suspects are Renauld's wife Eloise, his son Jack, Renauld's immediate neighbor Madame Daubreuil, the mysterious \"Cinderella\" of Hasting's recent acquaintance, and some unknown visitor of the previous day--all of whom Poirot has reason to suspect. Poirot's powers of investigation ultimately triumph over the wiles of an assailant whose misdirection and motives are nearly--but not quite--impossible to spot.\n\nContains a character key, a detailed biography, and an illustrated list of notable Poirot portrayals.\n\nLibrarian's note: the first fifteen novels in the Hercule Poirot series are 1) The Mysterious Affair at Styles, 1920; 2) The Murder on the Links, 1923; 3) The Murder of Roger Ackroyd, 1926; 4) The Big Four, 1927; 5) The Mystery of the Blue Train, 1928; 6) Peril at End House, 1932; 7) Lord Edgware Dies, 1933; 8) Murder on the Orient Express, 1934; 9) Three Act Tragedy, 1935; 10) Death in the Clouds, 1935; 11) The A.B.C. Murders, 1936; 12) Murder in Mesopotamia, 1936; 13) Cards on the Table, 1936; 14) Dumb Witness, 1937; and 15) Death on the Nile, 1937. These are just the novels; Poirot also appears in this period in a play, Black Coffee, 1930, and two collections of short stories, Poirot Investigates, 1924, and Murder in the Mews, 1937. Each novel, play and short story has its own entry on Goodreads.",
        "pages": 199,
        "publisher": "Warbler Classics",
        "publishedDate": "January 11, 2020",
        "author": "Agatha Christie",
        "title": "The Murder on the Links",
        "tags": [
            "Mystery",
            "Fiction",
            "Crime",
            "Classics",
            "Mystery Thriller",
            "Audiobook",
            "Detective",
            "British Literature",
            "Murder Mystery",
            "Thriller"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1388386575i/16331.jpg",
        "description": "‘Anyone who murdered Colonel Protheroe,’ declared the parson, brandishing a carving knife above a joint of roast beef, ‘would be doing the world at large a favour!’ It was a careless remark for a man of the cloth. And one which was to come back and haunt the clergyman just a few hours later – when the colonel was found shot dead in the clergyman’s study. But as Miss Marple soon discovers, the whole village seems to have had a motive to kill Colonel Protheroe.\n\nLibrarian's note: this entry is for the novel \"Murder at the Vicarage.\" Collections and other Miss Marple stories are located elsewhere on Goodreads. The series includes 12 novels and 20 short stories. Entries for the short stories can be found by searching Goodreads for: \"a Miss Marple Short Story.\"",
        "pages": 288,
        "publisher": "Black Dog & Leventhal Publishers",
        "publishedDate": "September 1, 2006",
        "author": "Agatha Christie",
        "title": "Murder at the Vicarage",
        "tags": [
            "Mystery",
            "Fiction",
            "Classics",
            "Crime",
            "Mystery Thriller",
            "Detective",
            "Audiobook",
            "Cozy Mystery",
            "British Literature",
            "Thriller"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1601937850i/54814676.jpg",
        "description": "A memoir about growing up Korean American, losing her mother, and forging her own identity.\n\nMichelle Zauner tells of growing up one of the few Asian American kids at her school in Eugene, Oregon; of struggling with her mother's particular, high expectations of her; of a painful adolescence; of treasured months spent in her grandmother's tiny apartment in Seoul, where she and her mother would bond, late at night, over heaping plates of food.\n\nAs she grew up, moving to the East Coast for college, finding work in the restaurant industry, and performing gigs with her fledgling band--and meeting the man who would become her husband--her Koreanness began to feel ever more distant, even as she found the life she wanted to live. It was her mother's diagnosis of terminal cancer, when Michelle was twenty-five, that forced a reckoning with her identity and brought her to reclaim the gifts of taste, language, and history her mother had given her.",
        "pages": 242,
        "publisher": "Knopf Publishing Group",
        "publishedDate": "April 20, 2021",
        "author": "Michelle Zauner",
        "title": "Crying in H Mart",
        "tags": [
            "Nonfiction",
            "Memoir",
            "Audiobook",
            "Biography",
            "Food",
            "Biography Memoir",
            "Adult",
            "Music",
            "Autobiography",
            "Contemporary"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1649286799i/59364173.jpg",
        "description": "A heartbreaking and hilarious memoir by iCarly and Sam & Cat star Jennette McCurdy about her struggles as a former child actor—including eating disorders, addiction, and a complicated relationship with her overbearing mother—and how she retook control of her life.\n\nJennette McCurdy was six years old when she had her first acting audition. Her mother’s dream was for her only daughter to become a star, and Jennette would do anything to make her mother happy. So she went along with what Mom called “calorie restriction,” eating little and weighing herself five times a day. She endured extensive at-home makeovers while Mom chided, “Your eyelashes are invisible, okay? You think Dakota Fanning doesn’t tint hers?” She was even showered by Mom until age sixteen while sharing her diaries, email, and all her income.\n\nIn I’m Glad My Mom Died, Jennette recounts all this in unflinching detail—just as she chronicles what happens when the dream finally comes true. Cast in a new Nickelodeon series called iCarly, she is thrust into fame. Though Mom is ecstatic, emailing fan club moderators and getting on a first-name basis with the paparazzi (“Hi Gale!”), Jennette is riddled with anxiety, shame, and self-loathing, which manifest into eating disorders, addiction, and a series of unhealthy relationships. These issues only get worse when, soon after taking the lead in the iCarly spinoff Sam & Cat alongside Ariana Grande, her mother dies of cancer. Finally, after discovering therapy and quitting acting, Jennette embarks on recovery and decides for the first time in her life what she really wants.\n\nTold with refreshing candor and dark humor, I’m Glad My Mom Died is an inspiring story of resilience, independence, and the joy of shampooing your own hair.",
        "pages": 320,
        "publisher": "Simon & Schuster",
        "publishedDate": "August 9, 2022",
        "author": "Jennette McCurdy",
        "title": "I'm Glad My Mom Died",
        "tags": [
            "Nonfiction",
            "Memoir",
            "Audiobook",
            "Biography",
            "Mental Health",
            "Adult",
            "Autobiography",
            "Biography Memoir",
            "Humor",
            "Contemporary"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1649848581i/60435878.jpg",
        "description": "In this powerful novel about the cost of greatness, a legendary athlete attempts a comeback when the world considers her past her prime—from the New York Times bestselling author of Malibu Rising.\n\nCarrie Soto is fierce, and her determination to win at any cost has not made her popular. But by the time she retires from tennis, she is the best player the world has ever seen. She has shattered every record and claimed twenty Grand Slam titles. And if you ask Carrie, she is entitled to every one. She sacrificed nearly everything to become the best, with her father, Javier, as her coach. A former champion himself, Javier has trained her since the age of two.\n\nBut six years after her retirement, Carrie finds herself sitting in the stands of the 1994 US Open, watching her record be taken from her by a brutal, stunning player named Nicki Chan.\n\nAt thirty-seven years old, Carrie makes the monumental decision to come out of retirement and be coached by her father for one last year in an attempt to reclaim her record. Even if the sports media says that they never liked “the Battle-Axe” anyway. Even if her body doesn’t move as fast as it did. And even if it means swallowing her pride to train with a man she once almost opened her heart to: Bowe Huntley. Like her, he has something to prove before he gives up the game forever.\n\nIn spite of it all, Carrie Soto is back, for one epic final season. In this riveting and unforgettable novel, Taylor Jenkins Reid tells her most vulnerable, emotional story yet.",
        "pages": 384,
        "publisher": "Ballantine Books",
        "publishedDate": "August 30, 2022",
        "author": "Taylor Jenkins Reid",
        "title": "Carrie Soto Is Back",
        "tags": [
            "Fiction",
            "Historical Fiction",
            "Contemporary",
            "Audiobook",
            "Sports",
            "Romance",
            "Adult",
            "Historical",
            "Adult Fiction",
            "Literary Fiction"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1654371463i/18144590.jpg",
        "description": "Combining magic, mysticism, wisdom, and wonder into an inspiring tale of self-discovery, The Alchemist has become a modern classic, selling millions of copies around the world and transforming the lives of countless readers across generations.\n\nPaulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, following our dreams.",
        "pages": 175,
        "publisher": "HarperOne",
        "publishedDate": "April 15, 2014",
        "author": "Paulo Coelho",
        "title": "The Alchemist",
        "tags": [
            "Fiction",
            "Classics",
            "Fantasy",
            "Philosophy",
            "Novels",
            "Spirituality",
            "Self Help",
            "Literature",
            "Adventure",
            "Inspirational"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1465761302i/28257707.jpg",
        "description": "Alternate cover edition of ISBN 9780062457738\n\nIn this generation-defining self-help guide, a superstar blogger cuts through the crap to show us how to stop trying to be \"positive\" all the time so that we can truly become better, happier people.\n\nFor decades, we’ve been told that positive thinking is the key to a happy, rich life. \"F**k positivity,\" Mark Manson says. \"Let’s be honest, shit is f**ked and we have to live with it.\" In his wildly popular Internet blog, Manson doesn’t sugarcoat or equivocate. He tells it like it is—a dose of raw, refreshing, honest truth that is sorely lacking today. The Subtle Art of Not Giving a F**k is his antidote to the coddling, let’s-all-feel-good mindset that has infected American society and spoiled a generation, rewarding them with gold medals just for showing up.\n\nManson makes the argument, backed both by academic research and well-timed poop jokes, that improving our lives hinges not on our ability to turn lemons into lemonade, but on learning to stomach lemons better. Human beings are flawed and limited—\"not everybody can be extraordinary, there are winners and losers in society, and some of it is not fair or your fault.\" Manson advises us to get to know our limitations and accept them. Once we embrace our fears, faults, and uncertainties, once we stop running and avoiding and start confronting painful truths, we can begin to find the courage, perseverance, honesty, responsibility, curiosity, and forgiveness we seek.\n\nThere are only so many things we can give a f**k about so we need to figure out which ones really matter, Manson makes clear. While money is nice, caring about what you do with your life is better, because true wealth is about experience. A much-needed grab-you-by-the-shoulders-and-look-you-in-the-eye moment of real-talk, filled with entertaining stories and profane, ruthless humor, The Subtle Art of Not Giving a F**k is a refreshing slap for a generation to help them lead contented, grounded lives.",
        "pages": 212,
        "publisher": "Harper",
        "publishedDate": "September 13, 2016",
        "author": "Mark Manson",
        "title": "The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life",
        "tags": [
            "Nonfiction",
            "Self Help",
            "Psychology",
            "Audiobook",
            "Personal Development",
            "Philosophy",
            "Business",
            "Humor",
            "Adult",
            "Mental Health"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1655988385i/40121378.jpg",
        "description": "No matter your goals, Atomic Habits offers a proven framework for improving—every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.\n\nIf you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights.\n\nClear is known for his ability to distill complex topics into simple behaviors that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, readers will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field.\n\nLearn how to:\n- Make time for new habits (even when life gets crazy);\n- Overcome a lack of motivation and willpower;\n- Design your environment to make success easier;\n- Get back on track when you fall off course;\n...and much more.\n\nAtomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.",
        "pages": 319,
        "publisher": "Avery",
        "publishedDate": "October 16, 2018",
        "author": "James Clear",
        "title": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones",
        "tags": [
            "Nonfiction",
            "Self Help",
            "Psychology",
            "Personal Development",
            "Productivity",
            "Audiobook",
            "Business",
            "Leadership",
            "Science",
            "Health"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1348336780i/1052.jpg",
        "description": "Beloved by millions, this timeless classic holds the key to all you desire and everything you wish to accomplish. This is the book that reveals the secret to personal wealth.\n\nThe Success Secrets of the Ancients—\nAn Assured Road to Happiness and Prosperity\n\nCountless readers have been helped by the famous “Babylonian parables,” hailed as the greatest of all inspirational works on the subject of thrift, financial planning, and personal wealth. In language as simple as that found in the Bible, these fascinating and informative stories set you on a sure path to prosperity and its accompanying joys. Acclaimed as a modern-day classic, this celebrated bestseller offers an understanding of—and a solution to—your personal financial problems that will guide you through a lifetime. This is the book that holds the secrets to keeping your money—and making more.\n\nThe Richest Man in Babylon\nRead it and recommend it to loved ones—\nand get on the road to riches.\n\nMORE THAN TWO MILLION BOOKS SOLD",
        "pages": 194,
        "publisher": "Berkley Books",
        "publishedDate": "February 1, 2008",
        "author": "George S. Clason",
        "title": "The Richest Man in Babylon",
        "tags": [
            "Finance",
            "Business",
            "Nonfiction",
            "Self Help",
            "Personal Finance",
            "Money",
            "Personal Development",
            "Economics",
            "Classics",
            "Philosophy"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1348313018i/998.jpg",
        "description": "The incredible national bestseller that is changing people's lives -- and increasing their net worth!\n\nCAN YOU SPOT THE MILLIONAIRE NEXT DOOR?\n\nWho are the rich in this country?\n\nWhat do they do?\n\nWhere do they shop?\n\nWhat do they drive?\n\nHow do they invest?\n\nWhere did their ancestors come from?\n\nHow did they get rich?\n\nCan I ever become one of them?\n\nGet the answers in The Millionaire Next Door, the never-before-told story about wealth in America. You'll be surprised at what you find out....",
        "pages": 258,
        "publisher": "Gallery Books",
        "publishedDate": "October 1, 1998",
        "author": "Thomas J. Stanley",
        "title": "The Millionaire Next Door: The Surprising Secrets of America's Wealthy",
        "tags": [
            "Finance",
            "Nonfiction",
            "Business",
            "Personal Finance",
            "Self Help",
            "Money",
            "Economics",
            "Personal Development",
            "Audiobook",
            "Psychology"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1595373758i/53239311.jpg",
        "description": "Life can be beautiful if you make it beautiful. It is up to you.\n\nEddie Jaku always considered himself a German first, a Jew second. He was proud of his country. But all of that changed in November 1938, when he was beaten, arrested and taken to a concentration camp.\n\nOver the next seven years, Eddie faced unimaginable horrors every day, first in Buchenwald, then in Auschwitz, then on a Nazi death march. He lost family, friends, his country.\n\nBecause he survived, Eddie made the vow to smile every day. He pays tribute to those who were lost by telling his story, sharing his wisdom and living his best possible life. He now believes he is the 'happiest man on earth'.\n\nPublished as Eddie turns 100, this is a powerful, heartbreaking and ultimately hopeful memoir of how happiness can be found even in the darkest of times.",
        "pages": 208,
        "publisher": "Macmillan Australia",
        "publishedDate": "July 28, 2020",
        "author": "Eddie Jaku",
        "title": "The Happiest Man on Earth",
        "tags": [
            "Nonfiction",
            "Biography",
            "Memoir",
            "History",
            "Holocaust",
            "Audiobook",
            "War",
            "Autobiography",
            "Biography Memoir",
            "World War II"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1591869580i/53952835.jpg",
        "description": "Late in the night, fourteen-year-old Sam Watson steps onto a quiet overpass, climbs over the rail and looks down at the road far below.\n\nAt the other end of the same bridge, an old man, Vic, smokes his last cigarette.\n\nThe two see each other across the void. A fateful connection is made, and an unlikely friendship blooms. Slowly, we learn what led Sam and Vic to the bridge that night. Bonded by their suffering, each privately commits to the impossible task of saving the other.\n\nHoneybee is a heart-breaking, life-affirming novel that throws us headlong into a world of petty thefts, extortion plots, botched bank robberies, daring dog rescues and one spectacular drag show.\n\nAt the heart of Honeybee is Sam: a solitary, resilient young person battling to navigate the world as their true self; ensnared by a loyalty to a troubled mother, scarred by the volatility of a domineering step-father, and confounded by the kindness of new alliances.\n\nHoneybee is a tender, profoundly moving novel brimming with vivid characters and luminous words. It's about two lives forever changed by a chance encounter -- one offering hope, the other redemption. It's about when to persevere, and when to be merciful, as Sam learns when to let go, and when to hold on.",
        "pages": 421,
        "publisher": "Allen & Unwin",
        "publishedDate": "September 29, 2020",
        "author": "Craig Silvey",
        "title": "Honeybee",
        "tags": [
            "Fiction",
            "Contemporary",
            "LGBT",
            "Book Club",
            "Young Adult",
            "Australia",
            "Audiobook",
            "Queer",
            "Coming Of Age",
            "Transgender"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1657781256i/61439040.jpg",
        "description": "The new novel by George Orwell is the major work towards which all his previous writing has pointed. Critics have hailed it as his \"most solid, most brilliant\" work. Though the story of Nineteen Eighty-Four takes place thirty-five years hence, it is in every sense timely. The scene is London, where there has been no new housing since 1950 and where the city-wide slums are called Victory Mansions. Science has abandoned Man for the State. As every citizen knows only too well, war is peace.\n\nTo Winston Smith, a young man who works in the Ministry of Truth (Minitru for short), come two people who transform this life completely. One is Julia, whom he meets after she hands him a slip reading, \"I love you.\" The other is O'Brien, who tells him, \"We shall meet in the place where there is no darkness.\" The way in which Winston is betrayed by the one and, against his own desires and instincts, ultimately betrays the other, makes a story of mounting drama and suspense.\n\nAlternate cover edition can be found here.",
        "pages": 368,
        "publisher": "Plume",
        "publishedDate": "July 1, 2022",
        "author": "George Orwell",
        "title": "1984",
        "tags": [
            "Classics",
            "Fiction",
            "Science Fiction",
            "Dystopia",
            "Literature",
            "Novels",
            "Politics",
            "School",
            "Fantasy",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1553383690i/2657.jpg",
        "description": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it. \"To Kill A Mockingbird\" became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.\n\nCompassionate, dramatic, and deeply moving, \"To Kill A Mockingbird\" takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.",
        "pages": 336,
        "publisher": "Harper Perennial Modern Classics",
        "publishedDate": "May 23, 2006",
        "author": "Harper Lee",
        "title": "To Kill a Mockingbird",
        "tags": [
            "Classics",
            "Fiction",
            "Historical Fiction",
            "School",
            "Literature",
            "Young Adult",
            "Historical",
            "Read For School",
            "Novels",
            "High School"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1490528560i/4671.jpg",
        "description": "Alternate Cover Edition ISBN: 0743273567 (ISBN13: 9780743273565)\n\nThe Great Gatsby, F. Scott Fitzgerald's third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story of the fabulously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted \"gin was the national drink and sex the national obsession,\" it is an exquisitely crafted tale of America in the 1920s.\n\nThe Great Gatsby is one of the great classics of twentieth-century literature.\n\n(from the back cover)\n\n",
        "pages": 180,
        "publisher": "Scribner",
        "publishedDate": "January 1, 1925",
        "author": "F. Scott Fitzgerald",
        "title": "The Great Gatsby",
        "tags": [
            "Classics",
            "Fiction",
            "School",
            "Historical Fiction",
            "Literature",
            "Romance",
            "Novels",
            "Read For School",
            "High School",
            "American"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1325861570i/170448.jpg",
        "description": "Librarian's note: There is an Alternate Cover Edition for this edition of this book here.\n\nA farm is taken over by its overworked, mistreated animals. With flaming idealism and stirring slogans, they set out to create a paradise of progress, justice, and equality. Thus the stage is set for one of the most telling satiric fables ever penned –a razor-edged fairy tale for grown-ups that records the evolution from revolution against tyranny to a totalitarianism just as terrible.\nWhen Animal Farm was first published, Stalinist Russia was seen as its target. Today it is devastatingly clear that wherever and whenever freedom is attacked, under whatever banner, the cutting clarity and savage comedy of George Orwell’s masterpiece have a meaning and message still ferociously fresh.",
        "pages": 141,
        "publisher": "Signet Classics",
        "publishedDate": "April 1, 1996",
        "author": "George Orwell",
        "title": "Animal Farm",
        "tags": [
            "Classics",
            "Fiction",
            "Dystopia",
            "Fantasy",
            "Politics",
            "Literature",
            "School",
            "Science Fiction",
            "Novels",
            "Read For School"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1395582745i/18710190.jpg",
        "description": "The faction-based society that Tris Prior once believed in is shattered - fractured by violence and power struggles and scarred by loss and betrayal. So when offered a chance to explore the world past the limits she's known, Tris is ready. Perhaps beyond the fence, she and Tobias will find a simple new life together, free from complicated lies, tangled loyalties, and painful memories.\n\nBut Tris's new reality is even more alarming than the one she left behind. Old discoveries are quickly rendered meaningless. Explosive new truths change the hearts of those she loves. And once again, Tris must battle to comprehend to complexities of human nature - and of herself - while facing impossible choices about courage, allegiance, sacrifice, and love.\n\nTold from a riveting dual perspective, ALLEGIANT, by #1 New York Times best-selling author Veronica Roth, brings the DIVERGENT series to a powerful conclusion while revealing the secrets of the dystopian world that has captivated millions of readers in DIVERGENT and INSURGENT.",
        "pages": 531,
        "publisher": "HarperCollins Children's Book's",
        "publishedDate": "October 22, 2013",
        "author": "Veronica Roth",
        "title": "Allegiant",
        "tags": [
            "Young Adult",
            "Dystopia",
            "Fiction",
            "Fantasy",
            "Science Fiction",
            "Romance",
            "Adventure",
            "Teen",
            "Audiobook",
            "Post Apocalyptic"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1388240248i/7631105.jpg",
        "description": "Solving the Maze was supposed to be the end.\n \nThomas was sure that escape from the Maze would mean freedom for him and the Gladers. But WICKED isn’t done yet. Phase Two has just begun. The Scorch.\n \nThere are no rules. There is no help. You either make it or you die.\n \nThe Gladers have two weeks to cross through the Scorch—the most burned-out section of the world. And WICKED has made sure to adjust the variables and stack the odds against them.\n \nFriendships will be tested. Loyalties will be broken. All bets are off.\n \nThere are others now. Their survival depends on the Gladers’ destruction—and they’re determined to survive.",
        "pages": 362,
        "publisher": "Delacorte Press",
        "publishedDate": "October 12, 2010",
        "author": "James Dashner",
        "title": "The Scorch Trials",
        "tags": [
            "Young Adult",
            "Dystopia",
            "Science Fiction",
            "Fiction",
            "Fantasy",
            "Adventure",
            "Post Apocalyptic",
            "Teen",
            "Audiobook",
            "Mystery"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1586722918i/7260188.jpg",
        "description": "My name is Katniss Everdeen.\nWhy am I not dead?\nI should be dead.\n\nKatniss Everdeen, girl on fire, has survived, even though her home has been destroyed. Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.\n\nIt is by design that Katniss was rescued from the arena in the cruel and haunting Quarter Quell, and it is by design that she has long been part of the revolution without knowing it. District 13 has come out of the shadows and is plotting to overthrow the Capitol. Everyone, it seems, has had a hand in the carefully laid plans—except Katniss.\n\nThe success of the rebellion hinges on Katniss's willingness to be a pawn, to accept responsibility for countless lives, and to change the course of the future of Panem. To do this, she must put aside her feelings of anger and distrust. She must become the rebels' Mockingjay—no matter what the personal cost.",
        "pages": 398,
        "publisher": "Scholastic Press",
        "publishedDate": "August 24, 2010",
        "author": "Suzanne Collins",
        "title": "Mockingjay",
        "tags": [
            "Young Adult",
            "Dystopia",
            "Fiction",
            "Fantasy",
            "Science Fiction",
            "Romance",
            "Adventure",
            "Teen",
            "Post Apocalyptic",
            "Audiobook"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1383718290i/13079982.jpg",
        "description": "Sixty years after its original publication, Ray Bradbury’s internationally acclaimed novel Fahrenheit 451 stands as a classic of world literature set in a bleak, dystopian future. Today its message has grown more relevant than ever before.\n\nGuy Montag is a fireman. His job is to destroy the most illegal of commodities, the printed book, along with the houses in which they are hidden. Montag never questions the destruction and ruin his actions produce, returning each day to his bland life and wife, Mildred, who spends all day with her television “family.” But when he meets an eccentric young neighbor, Clarisse, who introduces him to a past where people didn’t live in fear and to a present where one sees the world through the ideas in books instead of the mindless chatter of television, Montag begins to question everything he has ever known.",
        "pages": 194,
        "publisher": "Simon & Schuster",
        "publishedDate": "November 29, 2011",
        "author": "Ray Bradbury",
        "title": "Fahrenheit 451",
        "tags": [
            "Classics",
            "Fiction",
            "Science Fiction",
            "Dystopia",
            "School",
            "Literature",
            "Novels",
            "Fantasy",
            "Audiobook",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327869409i/7624.jpg",
        "description": "At the dawn of the next world war, a plane crashes on an uncharted island, stranding a group of schoolboys. At first, with no adult supervision, their freedom is something to celebrate; this far from civilization the boys can do anything they want. Anything. They attempt to forge their own society, failing, however, in the face of terror, sin and evil. And as order collapses, as strange howls echo in the night, as terror begins its reign, the hope of adventure seems as far from reality as the hope of being rescued. Labeled a parable, an allegory, a myth, a morality tale, a parody, a political treatise, even a vision of the apocalypse, Lord of the Flies is perhaps our most memorable novel about “the end of innocence, the darkness of man’s heart.”",
        "pages": 182,
        "publisher": "Penguin Books",
        "publishedDate": "October 1, 1999",
        "author": "William Golding",
        "title": "Lord of the Flies",
        "tags": [
            "Classics",
            "Fiction",
            "Young Adult",
            "School",
            "Literature",
            "Dystopia",
            "Read For School",
            "Novels",
            "High School",
            "Adventure"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1511302904i/890.jpg",
        "description": "“I got you to look after me, and you got me to look after you, and that's\nwhy.”\n\nThey are an unlikely pair: George is \"small and quick and dark of face\"; Lennie, a man of tremendous size, has the mind of a young child. Yet they have formed a \"family,\" clinging together in the face of loneliness and alienation. Laborers in California's dusty vegetable fields, they hustle work when they can, living a hand-to-mouth existence. But George and Lennie have a plan: to own an acre of land and a shack they can call their own.\n\nWhile the powerlessness of the laboring class is a recurring theme in Steinbeck's work of the late 1930s, he narrowed his focus when composing 'Of Mice and Men' (1937), creating an intimate portrait of two men facing a world marked by petty tyranny, misunderstanding, jealousy, and callousness. But though the scope is narrow, the theme is universal: a friendship and a shared dream that makes an individual's existence meaningful.\n\nA unique perspective on life's hardships, this story has achieved the status of timeless classic due to its remarkable success as a novel, a Broadway play, and three acclaimed films.",
        "pages": 103,
        "publisher": "Penguin Books",
        "publishedDate": "January 1, 2002",
        "author": "John Steinbeck",
        "title": "Of Mice and Men",
        "tags": [
            "Classics",
            "Fiction",
            "School",
            "Historical Fiction",
            "Literature",
            "Read For School",
            "Novels",
            "High School",
            "American",
            "Historical"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1629680008i/18135.jpg",
        "description": "In Romeo and Juliet, Shakespeare creates a violent world, in which two young people fall in love. It is not simply that their families disapprove; the Montagues and the Capulets are engaged in a blood feud.\n\nIn this death-filled setting, the movement from love at first sight to the lovers’ final union in death seems almost inevitable. And yet, this play set in an extraordinary world has become the quintessential story of young love. In part because of its exquisite language, it is easy to respond as if it were about all young lovers.",
        "pages": 281,
        "publisher": "Washington Square Press",
        "publishedDate": "January 1, 2002",
        "author": "William Shakespeare",
        "title": "Romeo and Juliet",
        "tags": [
            "Classics",
            "Plays",
            "Fiction",
            "Romance",
            "School",
            "Drama",
            "Read For School",
            "Literature",
            "High School",
            "Poetry"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1631088473i/35031085.jpg",
        "description": "This is a previously-published edition of ISBN 9780143131847.\n\nMary Shelley's seminal novel of the scientist whose creation becomes a monster\n\nThis edition is the original 1818 text, which preserves the hard-hitting and politically charged aspects of Shelley's original writing, as well as her unflinching wit and strong female voice. This edition also includes a new introduction and suggestions for further reading by author and Shelley expert Charlotte Gordon, literary excerpts and reviews selected by Gordon and a chronology and essay by preeminent Shelley scholar Charles E. Robinson.",
        "pages": 260,
        "publisher": "Penguin Classics",
        "publishedDate": "March 8, 2018",
        "author": "Mary Wollstonecraft Shelley",
        "title": "Frankenstein: The 1818 Text",
        "tags": [
            "Classics",
            "Fiction",
            "Horror",
            "Science Fiction",
            "Gothic",
            "Fantasy",
            "School",
            "Literature",
            "Novels",
            "Read For School"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1387151694i/17245.jpg",
        "description": "You can find an alternative cover edition for this ISBN here and here.\n\nWhen Jonathan Harker visits Transylvania to help Count Dracula with the purchase of a London house, he makes a series of horrific discoveries about his client. Soon afterwards, various bizarre incidents unfold in England: an apparently unmanned ship is wrecked off the coast of Whitby; a young woman discovers strange puncture marks on her neck; and the inmate of a lunatic asylum raves about the 'Master' and his imminent arrival.\n\nIn Dracula, Bram Stoker created one of the great masterpieces of the horror genre, brilliantly evoking a nightmare world of vampires and vampire hunters and also illuminating the dark corners of Victorian sexuality and desire.\n\nThis Norton Critical Edition includes a rich selection of background and source materials in three areas: Contexts includes probable inspirations for Dracula in the earlier works of James Malcolm Rymer and Emily Gerard. Also included are a discussion of Stoker's working notes for the novel and \"Dracula's Guest,\" the original opening chapter to Dracula. Reviews and Reactions reprints five early reviews of the novel. \"Dramatic and Film Variations\" focuses on theater and film adaptations of Dracula, two indications of the novel's unwavering appeal. David J. Skal, Gregory A. Waller, and Nina Auerbach offer their varied perspectives. Checklists of both dramatic and film adaptations are included.\n\nCriticism collects seven theoretical interpretations of Dracula by Phyllis A. Roth, Carol A. Senf, Franco Moretti, Christopher Craft, Bram Dijkstra, Stephen D. Arata, and Talia Schaffer.\n\nA Chronology and a Selected Bibliography are included.",
        "pages": 488,
        "publisher": "Norton",
        "publishedDate": "May 12, 1986",
        "author": "Bram Stoker",
        "title": "Dracula",
        "tags": [
            "Classics",
            "Horror",
            "Fiction",
            "Fantasy",
            "Vampires",
            "Gothic",
            "Paranormal",
            "Literature",
            "Audiobook",
            "19th Century"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1334416842i/830502.jpg",
        "description": "Welcome to Derry, Maine ...\n\nIt’s a small city, a place as hauntingly familiar as your own hometown. Only in Derry the haunting is real ...\n\nThey were seven teenagers when they first stumbled upon the horror. Now they are grown-up men and women who have gone out into the big world to gain success and happiness. But none of them can withstand the force that has drawn them back to Derry to face the nightmare without an end, and the evil without a name.",
        "pages": 1116,
        "publisher": "New English Library",
        "publishedDate": "October 1, 1987",
        "author": "Stephen King",
        "title": "It",
        "tags": [
            "Horror",
            "Fiction",
            "Thriller",
            "Fantasy",
            "Audiobook",
            "Classics",
            "Mystery",
            "Adult",
            "Paranormal",
            "Supernatural"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1375168676i/179780.jpg",
        "description": "Georgetown, Washington D.C. Actress and divorced mother Chris MacNeil starts to experience 'difficulties' with her usually sweet-natured eleven-year-old daughter Regan. The child becomes afflicted by spasms, convulsions and unsettling amnesiac episodes; these abruptly worsen into violent fits of appalling foul-mouthed curses, accompanied by physical mutation. Medical science is baffled by Regan's plight and, in her increasing despair, Chris turns to troubled priest and psychiatrist Damien Karras, who immediately recognises something profoundly malevolent in Regan's distorted fetures and speech. On Karras's recommendation, the Church summons Father Merrin, a specialist in the exorcism of demons . . .",
        "pages": 385,
        "publisher": "HarperTorch",
        "publishedDate": "February 1, 1994",
        "author": "William Peter Blatty",
        "title": "The Exorcist",
        "tags": [
            "Horror",
            "Fiction",
            "Classics",
            "Paranormal",
            "Thriller",
            "Supernatural",
            "Fantasy",
            "Religion",
            "Audiobook",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1639587647i/960.jpg",
        "description": "World-renowned Harvard symbologist Robert Langdon is summoned to a Swiss research facility to analyze a cryptic symbol seared into the chest of a murdered physicist. What he discovers is unimaginable: a deadly vendetta against the Catholic Church by a centuries-old underground organization -- the Illuminati. In a desperate race to save the Vatican from a powerful time bomb, Langdon joins forces in Rome with the beautiful and mysterious scientist Vittoria Vetra. Together they embark on a frantic hunt through sealed crypts, dangerous catacombs, and deserted cathedrals, and into the depths of the most secretive vault on earth...the long-forgotten Illuminati lair.\n(back cover)",
        "pages": 736,
        "publisher": "Pocket Books",
        "publishedDate": "April 1, 2006",
        "author": "Dan Brown",
        "title": "Angels & Demons",
        "tags": [
            "Fiction",
            "Mystery",
            "Thriller",
            "Mystery Thriller",
            "Suspense",
            "Adventure",
            "Crime",
            "Historical Fiction",
            "Novels",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1372848476i/17587594.jpg",
        "description": "The Dan Brown Inferno Unofficial Guide will allow you to decode the masterful and clever codes, symbols and art history of Dan Brown's fourth international blockbuster, Inferno and follow in the footsteps of the great puzzle solver Robert Langdon. Dan Brown's new international blockbuster, Inferno, will be his fourth book fusing history, art, codes and symbols. This guide includes:\nA Complete Summary of Dante's Inferno on which Dan Brown has based his newest bestselling novel\nA Complete Guide to the Many Levels of Hell in Dante's Inferno\nA Complete List of Characters and People that appear in Dante's Inferno and their origins in Biblical and Classical mythology\nTranslation of the important Latin phrases contained in Dante's Inferno",
        "pages": 119,
        "publisher": "Ebookit.com",
        "publishedDate": "August 9, 2013",
        "author": "Stephen Eastment",
        "title": "Dan Brown Inferno (Robert Langdon) Unofficial Guide",
        "tags": [
            "Fiction",
            "Thriller",
            "Mystery Thriller",
            "Mystery",
            "Suspense",
            "Drama",
            "Contemporary",
            "Action",
            "Historical Fiction"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1463592438i/30228538.jpg",
        "description": "Dan Brown's mega-bestseller is now available for a new generation of readers. This young adult adaptation takes readers from Paris to London on a breathless tour of famous landmarks and will remind fans everywhere why the New York Times calls The Da Vinci Code blockbuster perfection.\n\n\"The greatest conspiracy of the past two thousand years is about to unravel.\"\n\nRobert Langdon, professor of religious symbology at Harvard, is in Paris to give a lecture. At the reception that follows, he is scheduled to meet with a revered curator from the world-famous Louvre museum. But the curator never shows up, and later that night Langdon is awakened by authorities and told that the curator has been found dead. He is then taken to the Louvre the scene of the crime where he finds out that baffling clues have been left behind.\n\nThus begins a race against time, as Robert Langdon becomes a suspect and, with the help of French cryptologist Sophie Neveu, must decipher a mystifying trail of clues that the two come to realize have been left specifically for them. If Robert and Sophie cannot solve the puzzle in time, an ancient truth could be lost forever and they themselves might end up as collateral damage.",
        "pages": 460,
        "publisher": "Delacorte Press",
        "publishedDate": "September 13, 2016",
        "author": "Dan Brown",
        "title": "The Da Vinci Code",
        "tags": [
            "Fiction",
            "Mystery",
            "Thriller",
            "Historical Fiction",
            "Young Adult",
            "Classics",
            "Mystery Thriller",
            "Historical",
            "Adventure",
            "Novels"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1403744290i/6372.jpg",
        "description": "Just where does fact end and fiction begin? The brilliant mix of fact and fiction in Dan Brown's Conspiracy story \"The Da Vinci Code\" raises serious questions regarding the origins and claims of Christianity. Many come away from the book shaken in their beliefs, wondering what is true? Questions like \"Was Mary Magdalene really Jesus' wife and the mother of his child?\" And more. McDowell skillfully separates facts from fallacy. This is a book you and your friends should have right now! One reviewer wrote \"An excellent little book and very easy read. Written as an ongoing discussion among three college students who saw the DaVinci Code movie and then had many questions about the supposed \"facts\" in the book...only to discover that author Dan Brown is a brilliant author, but lousy historian who fabricates most of his \"facts.\" An excellent little book that really makes you think and want to dig for the truth!\" by Mr. Michael A. Dorough \"uth dude\" (Warner Robins, GA)",
        "pages": 120,
        "publisher": "Green Key Books",
        "publishedDate": "January 1, 2006",
        "author": "Josh McDowell",
        "title": "The DaVinci Code: A Quest for Answers",
        "tags": [
            "Fiction",
            "Mystery",
            "Thriller",
            "Classics",
            "Christianity",
            "Adult",
            "Religion",
            "Mystery Thriller",
            "Historical",
            "Novels"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1642783478i/59588753.jpg",
        "description": "Canon Daniel Clement is Rector of Champton. He has been there for eight years, living at the Rectory alongside his widowed mother - opinionated, fearless, ever-so-slightly annoying Audrey - and his two dachshunds, Cosmo and Hilda.\n\nWhen Daniel announces a plan to install a lavatory in church, the parish is suddenly (and unexpectedly) divided: as lines are drawn, long-buried secrets come dangerously close to destroying the apparent calm of the village.\n\nAnd then Anthony Bowness - cousin to Bernard de Floures, patron of Champton - is found dead at the back of the church, stabbed in the neck with a pair of secateurs.\n\nAs the police moves in and the bodies start piling up, Daniel is the only one who can try and keep his fractured community together... and catch a killer.",
        "pages": 352,
        "publisher": "Weidenfeld & Nicholson",
        "publishedDate": "June 9, 2022",
        "author": "Richard Coles",
        "title": "Murder Before Evensong",
        "tags": [
            "Fiction",
            "Crime",
            "Mystery",
            "Cozy Mystery",
            "Mystery Thriller",
            "British Literature",
            "Murder Mystery",
            "Religion",
            "Audiobook",
            "Contemporary"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1649424135i/58957615.jpg",
        "description": "It is an ordinary Thursday, and things should finally be returning to normal.\n\nExcept trouble is never far away where the Thursday Murder Club are concerned. A local news legend is on the hunt for a sensational headline, and soon the gang are hot on the trail of two murders, ten years apart.\n\nTo make matters worse, a new nemesis pays Elizabeth a visit, presenting her with a deadly mission: kill or be killed...\n\nWhile Elizabeth grapples with her conscience (and a gun), the gang and their unlikely new friends (including TV stars, money launderers and ex-KGB colonels) unravel a new mystery. But can they catch the culprit and save Elizabeth before the murderer strikes again?",
        "pages": 413,
        "publisher": "Viking",
        "publishedDate": "September 15, 2022",
        "author": "Richard Osman",
        "title": "The Bullet That Missed",
        "tags": [
            "Mystery",
            "Fiction",
            "Crime",
            "Audiobook",
            "Mystery Thriller",
            "Humor",
            "Thriller",
            "Cozy Mystery",
            "Adult",
            "Contemporary"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1653585172i/60461888.jpg",
        "description": "'Our deal is over.'\n\nThat's what reluctant author Anthony Horowitz tells ex-detective Daniel Hawthorne in an awkward meeting. The truth is that Anthony has other things on his mind.\n\nHis new play, Mindgame, is about to open in London's Vaudeville theatre. Not surprisingly Hawthorne declines a ticket.\n\nOn opening night, Sunday Times critic Harriet Throsby gives the play a savage review, focusing particularly on the writing. The next morning she is found dead, stabbed in the heart with an ornamental dagger which, it turns out, belongs to Anthony and which has his finger prints all over it.\n\nAnthony is arrested, charged with Throsby's murder, thrown into prison and interrogated.\n\nAlone and increasingly desperate, he realises only one man can help him.\n\nBut will Hawthorne take his call?",
        "pages": 384,
        "publisher": "Harper",
        "publishedDate": "November 15, 2022",
        "author": "Anthony Horowitz",
        "title": "The Twist of a Knife",
        "tags": [
            "Mystery",
            "Fiction",
            "Crime",
            "Audiobook",
            "Mystery Thriller",
            "Thriller",
            "British Literature",
            "Detective",
            "Murder Mystery",
            "Contemporary"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1655071269i/60980164.jpg",
        "description": "A murderer strikes at a school reunion--but the students are no strangers to death-- in this propulsive, twisty thriller from the internationally bestselling author of the Ruth Galloway Mysteries\n\nIs it possible to forget that you've committed a murder?\n\nWhen Cassie Fitzgerald was at school in the late 90s, she and her friends killed a fellow student. Almost twenty years later, Cassie is a happily married mother who loves her job--as a police officer. She closely guards the secret she has all but erased from her memory.\n\nOne day her husband finally persuades her to go to a school reunion. Cassie catches up with her high-achieving old friends from the Manor Park School--among them two politicians, a rock star, and a famous actress. But then, shockingly, one of them, Garfield Rice, is found dead in the school bathroom, supposedly from a drug overdose. As Garfield was an eminent--and controversial--MP and the investigation is high profile, it's headed by Cassie's new boss, DI Harbinder Kaur, freshly promoted and newly arrived in London. The trouble is, Cassie can't shake the feeling that one of them has killed again.\n\nIs Cassie right, or was Garfield murdered by one of his political cronies? It's in Cassie's interest to skew the investigation so that it looks like it has nothing to do with Manor Park and she seems to be succeeding.\n\nUntil someone else from the reunion is found dead in Bleeding Heart Yard...",
        "pages": 352,
        "publisher": "Mariner Books",
        "publishedDate": "November 15, 2022",
        "author": "Elly Griffiths",
        "title": "Bleeding Heart Yard",
        "tags": [
            "Mystery",
            "Fiction",
            "Crime",
            "Mystery Thriller",
            "Audiobook",
            "Thriller",
            "Suspense",
            "British Literature",
            "Contemporary",
            "Adult Fiction"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1655753538i/59808344.jpg",
        "description": "For fifty years a group of friends have been meeting regularly for reunions on Holy Island, celebrating the school trip where they met, and the friend that they lost to the rising causeway tide five years later. Now, when one of them is found hanged, Vera is called in. Learning that the dead man had recently been fired after misconduct allegations, Vera knows she must discover what the friends are hiding, and whether the events of many years before could have led to murder then, and now . . .\n\nBut with the tide rising, secrets long-hidden are finding their way to the surface, and Vera and the team may find themselves in more danger than they could have believed possible . . .",
        "pages": 384,
        "publisher": "Minotaur Books",
        "publishedDate": "September 6, 2022",
        "author": "Ann Cleeves",
        "title": "The Rising Tide",
        "tags": [
            "Mystery",
            "Fiction",
            "Crime",
            "Mystery Thriller",
            "British Literature",
            "Detective",
            "Audiobook",
            "Thriller",
            "Murder Mystery",
            "Adult Fiction"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660936424i/60899502.jpg",
        "description": "Chief Inspector Armand Gamache returns in the eighteenth book in #1 New York Times bestseller Louise Penny's beloved series.\n\nIt’s spring and Three Pines is reemerging after the harsh winter. But not everything buried should come alive again. Not everything lying dormant should reemerge.\n\nBut something has.\n\nAs the villagers prepare for a special celebration, Armand Gamache and Jean-Guy Beauvoir find themselves increasingly worried. A young man and woman have reappeared in the Sûreté du Québec investigators’ lives after many years. The two were young children when their troubled mother was murdered, leaving them damaged, shattered. Now they’ve arrived in the village of Three Pines.\n\nBut to what end?\n\nGamache and Beauvoir’s memories of that tragic case, the one that first brought them together, come rushing back. Did their mother’s murder hurt these children beyond repair? Have those terrible wounds, buried for decades, festered, and are they now about to erupt?\n\nAs Chief Inspector Gamache works to uncover answers, his alarm grows when a letter written by a long-dead stonemason is discovered. In it, the man describes his terror when bricking up an attic room somewhere in the village. Every word of the 160-year-old letter is filled with dread. When the room is found, the villagers decide to open it up.\n\nAs the bricks are removed, Gamache, Beauvoir, and the villagers discover a world of curiosities. But the head of homicide soon realizes there’s more in that room than meets the eye. There are puzzles within puzzles, and hidden messages warning of mayhem and revenge.\n\nIn unsealing that room, an old enemy is released into their world. Into their lives. And into the very heart of Armand Gamache’s home.",
        "pages": 390,
        "publisher": "Minotaur Books",
        "publishedDate": "November 29, 2022",
        "author": "Louise Penny",
        "title": "A World of Curiosities",
        "tags": [
            "Mystery",
            "Fiction",
            "Canada",
            "Mystery Thriller",
            "Audiobook",
            "Crime",
            "Thriller",
            "Detective",
            "Adult Fiction",
            "Suspense"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1649275210i/60219987.jpg",
        "description": "LAPD detective Renée Ballard and Harry Bosch work together to hunt the killer who is Bosch’s “white whale”—a man responsible for the murder of an entire family.\n\nA year has passed since LAPD detective Renée Ballard quit the force in the face of misogyny, demoralization, and endless red tape. Yet, after the chief of police himself tells her she can write her ticket within the department, Ballard takes back her badge, leaving “the Late Show” to rebuild the cold case unit at the elite Robbery-Homicide Division.\n \nFor years, Harry Bosch has been working a case that haunts him but that he hasn’t been able to crack—the murder of an entire family by a psychopath who still walks free. Ballard makes Bosch an offer: come work with her as a volunteer investigator in the new Open-Unsolved Unit, and he can pursue his “white whale” with the resources of the LAPD behind him.\n\nThe two must put aside old resentments to work together again and close in on a dangerous killer. Propulsive and unstoppable, this new novel demonstrates once again why “Connelly is the real deal” (Marilyn Stasio, New York Times Book Review).",
        "pages": 400,
        "publisher": "Little, Brown and Company",
        "publishedDate": "November 8, 2022",
        "author": "Michael Connelly",
        "title": "Desert Star",
        "tags": [
            "Mystery",
            "Fiction",
            "Crime",
            "Thriller",
            "Mystery Thriller",
            "Audiobook",
            "Suspense",
            "Detective",
            "Adult",
            "Contemporary"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1653059515i/60395678.jpg",
        "description": "Memory man FBI agent, Amos Decker, returns in this action-packed thriller to investigate the mysterious and brutal murder of a federal judge and her bodyguard at her home in an exclusive, gated community in Florida.\n\nThings are changing for Decker. He’s in crisis following the suicide of a close friend and receipt of a letter concerning a personal issue which could change his life forever. Together with the prospect of working with a new partner, Frederica White, Amos knows that this case will take all of his special skills to solve.\n\nAs darkness falls, evil comes to light . . .\n\nJudge Julia Cummins seemingly had no enemies, and there was no forced entry to her property. Close friends and neighbours in the community apparently heard nothing, and Cummins’ distraught ex-husband, Barry, and teenage son, Tyler, both have strong alibis. Decker must first find the answer to why the judge felt the need for a bodyguard, and the meaning behind the strange calling card left by the killer.\n\nSomeone has decided it’s payback time.",
        "pages": 448,
        "publisher": "Grand Central Publishing",
        "publishedDate": "October 11, 2022",
        "author": "David Baldacci",
        "title": "Long Shadows",
        "tags": [
            "Mystery",
            "Fiction",
            "Thriller",
            "Crime",
            "Mystery Thriller",
            "Audiobook",
            "Suspense",
            "Detective",
            "Murder Mystery",
            "Adult"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1645436799i/60312252.jpg",
        "description": "Private investigator Elvis Cole and his enigmatic partner Joe Pike are back on the case in this brilliant new thriller from #1 New York Times bestselling author Robert Crais.\n\nAdele Schumacher isn't a typical worried mom. When she hires Elvis to find her missing son, a controversial podcaster named Josh Shoe, she brings a bag filled with cash, bizarre tales of government conspiracies, and a squad of professional bodyguards. Finding Josh should be simple, but Elvis quickly learns he isn't alone in the hunt -- a deadly team of mysterious strangers are determined to find Josh and his adult film star girlfriend first.\n\nWith Elvis being watched and dangerous secrets lurking behind every lead, Elvis needs his friend Joe Pike more than ever to uncover the truth about Josh, corrupt politicians, and the vicious business cartels rotting the heart of Los Angeles from within. And when Elvis Cole's estranged girlfriend Lucy Chenier and her son Ben return, Elvis learns just how much he has to lose...if he survives.\n\nWritten with the heart, humor, and relentless suspense for which Crais is famous, Racing The Light delivers Elvis Cole's most dangerous case yet.",
        "pages": 368,
        "publisher": "G.P. Putnam's Sons",
        "publishedDate": "November 1, 2022",
        "author": "Robert Crais",
        "title": "Racing the Light",
        "tags": [
            "Mystery",
            "Fiction",
            "Thriller",
            "Mystery Thriller",
            "Crime",
            "Detective",
            "Suspense",
            "Audiobook",
            "Action",
            "Contemporary"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1641499469i/60048804.jpg",
        "description": "The gripping new Jack Reacher thriller from the #1 New York Times bestselling authors Lee Child and Andrew Child. The plan: It's coming Fall 2022. No Plan B.\n\nIn Gerrardsville, Colorado, two witnesses to the same tragedy give two different accounts. One guy sees a woman throw herself in front of a bus in what authorities will call a suicide. The other witness is Jack Reacher. And he sees what actually happened: A man in a gray hoodie and jeans, moving like a shadow, pushed the victim to her death—before swiftly grabbing the dead woman’s purse and strolling away.\n\nReacher follows the killer on foot, not knowing that he is part of something much bigger and far-reaching . . . a secret conspiracy with many moving parts, with powerful people on the take, all involved in an undertaking that leaves no room for error. If any step is compromised, the threat will have to be quickly and quietly and permanently removed.\n\nBecause when the threat is Reacher, there is No Plan B….",
        "pages": 336,
        "publisher": "Delacorte Press",
        "publishedDate": "October 25, 2022",
        "author": "Lee Child",
        "title": "No Plan B",
        "tags": [
            "Thriller",
            "Fiction",
            "Mystery",
            "Crime",
            "Action",
            "Suspense",
            "Mystery Thriller",
            "Audiobook",
            "Military Fiction",
            "Detective"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1394988109i/22034.jpg",
        "description": "The Godfather—the epic tale of crime and betrayal that became a global phenomenon.\n\nAlmost fifty years ago, a classic was born. A searing portrayal of the Mafia underworld, The Godfather introduced readers to the first family of American crime fiction, the Corleones, and their powerful legacy of tradition, blood, and honor. The seduction of power, the pitfalls of greed, and the allegiance to family—these are the themes that have resonated with millions of readers around the world and made The Godfather the definitive novel of the violent subculture that, steeped in intrigue and controversy, remains indelibly etched in our collective consciousness.",
        "pages": 448,
        "publisher": "NAL",
        "publishedDate": "March 1, 2002",
        "author": "Mario Puzo",
        "title": "The Godfather",
        "tags": [
            "Fiction",
            "Classics",
            "Crime",
            "Thriller",
            "Historical Fiction",
            "Mystery",
            "Novels",
            "Drama",
            "Literature",
            "American"
        ]
    },
    {
        "imgSource": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1388189495i/79029.jpg",
        "description": "The third, and final, installment in Mario Puzo's epic chronicle of the Corleone crime family-one of the most enduring lineages in American literature and cinema-achieves a stunning crescendo with a story that imagines the role of the Mafia in the assassination of a young, charismatic president.\nIt's impossible to overstate the influence of Mario Puzo's \"The Godfather,\" which has become an essential part of our cultural lexicon. Puzo's novel about the secret world of organized crime became a megabestseller and an instant classic. The book inspired the Francis Ford Coppola films-unprecedented successes in their own right-and launched a national obsession with the Mafia that continues unabated today.\nIn \"The Godfather's Revenge\"-again authorized by the Puzo Estate-Mark Winegardner moves the Corleone family onto the biggest stage of all: the intersection of organized crime and national politics. A subordinate to Michael Corleone, New Orleans underboss Carlo Tramonti is publicly humiliated when the U.S. Attorney General-President Danny Shea's brother-has him arrested and deported to Colombia. Tramonti eventually returns, hell-bent on settling scores, and triggers a series of events destined to change the course of American history. Corleone, though haunted by the death of his brother Fredo, knows that this is no time for weakness-and so, with fearless consigliere Tom Hagen leading the way, a new path for the future is forged.\nAs the dramatic twists of \"The Godfather's Revenge\" take the reader from Las Vegas to Miami to New Orleans, from the power alleys of Washington, D.C., to the remote jungles of Colombia, the puppet master behind the curtain remains Michael Corleone, the tortured prodigal son who is determined to redefine his family's legacy and make his father-the original Godfather-proud.",
        "pages": 487,
        "publisher": "Putnam Adult",
        "publishedDate": "November 7, 2006",
        "author": "Mark Winegardner",
        "title": "The Godfather's Revenge",
        "tags": [
            "Fiction",
            "Crime",
            "Thriller",
            "Mystery",
            "Classics",
            "Historical Fiction",
            "Mystery Thriller",
            "Drama",
            "Novels",
            "Adult"
        ]
    }
]